notes/org/aws/commands.org
#+TITLE: AWS Commands
#+SETUPFILE: ../../setup.org
#+PROPERTY: header-args+ :results output
#+PROPERTY: header-args+ :cache yes

* Variables                                                        :noexport:

  #+NAME: env
  | Env Var            | Value     |
  |--------------------+-----------|
  | AWS_PROFILE        | prod      |
  | AWS_DEFAULT_REGION | us-east-1 |

  #+begin_src emacs-lisp :var env=env
    (environ-set-pairs env)
  #+end_src

* Account

  Account number:

  #+name: Account
  #+begin_src sh
    aws sts get-caller-identity \
        --query 'Account' \
        --output text
  #+end_src

* IP Address Ranges

  AWS documentation is [[https://docs.aws.amazon.com/general/latest/gr/aws-ip-ranges.html][here]].

  #+NAME: IpRanges
  #+begin_src sh :results file :file ip_ranges.json
    curl -s https://ip-ranges.amazonaws.com/ip-ranges.json
  #+end_src

  #+RESULTS: IpRanges
  [[file:ip_ranges.json]]

  #+begin_src sh :var IpRanges=IpRanges
    cat "$IpRanges" \
        | jq '.prefixes[]
              | select(.region = "us-east-2")
              | .ip_prefix'
  #+end_src

** Get Region of IP

   (Would be cool).

   Check IP address against each CIDR range. Would be cool to do this using bit
   comparisons.

   See: https://unix.stackexchange.com/questions/274330/check-ip-is-in-range-of-whitelist-array

* Regions

** All regions in partition

   #+NAME: AllRegions
   #+begin_src sh
     aws ec2 describe-regions \
         | jq -r ".Regions[].RegionName"
   #+end_src

   #+RESULTS[04317e7a06778532f7f315cce532515421a80543]: AllRegions
   : eu-north-1
   : ap-south-1
   : eu-west-3
   : eu-west-2
   : eu-west-1
   : ap-northeast-3
   : ap-northeast-2
   : ap-northeast-1
   : sa-east-1
   : ca-central-1
   : ap-southeast-1
   : ap-southeast-2
   : eu-central-1
   : us-east-1
   : us-east-2
   : us-west-1
   : us-west-2

   Number of regions:

   #+begin_src sh :var AllRegions=AllRegions
     echo $AllRegions | wc -w   # Using wc

     regions=($AllRegions)      # Or use an array, and
     echo ${#regions[*]}        # print array length
   #+end_src

   #+RESULTS:
   : 21
   : 21

** All regions in all partitions

   Should be in the botocore data files. Also, we can pull them from the IpRanges
   document. You have to decide whether "GLOBAL" is a "region" in your situation.

   #+begin_src sh :var IpRanges=IpRanges
     cat "$IpRanges" \
         | jq -r '.prefixes[].region' \
         | sort | uniq
   #+end_src

** Run a command in all regions

*** Linear

    Get the number of VPCs in each region the slow and simple way.

    #+header: :var regions=AllRegions
    #+begin_src sh
      for region in $regions; do
          vpcs=($(aws --region $region ec2 describe-vpcs | jq '.Vpcs[].VpcId'))
          echo "$region: ${#vpcs[*]}"
      done
    #+end_src

    #+RESULTS:
    : eu-north-1: 0
    : ap-south-1: 0
    : eu-west-3: 0
    : eu-west-2: 0
    : eu-west-1: 0
    : ap-northeast-3: 1
    : ap-northeast-2: 0
    : ap-northeast-1: 0
    : sa-east-1: 0
    : ca-central-1: 0
    : ap-southeast-1: 1
    : ap-southeast-2: 0
    : eu-central-1: 0
    : us-east-1: 2
    : us-east-2: 3
    : us-west-1: 0
    : us-west-2: 0

