docs/notes/aws/commands.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AWS Commands</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">AWS Commands</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org794f761">Account</a></li>
<li><a href="#org1f7c126">IP Address Ranges</a>
<ul>
<li><a href="#org71c9ae4">Get Region of IP</a></li>
</ul>
</li>
<li><a href="#orga2c80b6">Regions</a>
<ul>
<li><a href="#org3b1ae44">All regions in partition</a></li>
<li><a href="#org87aae0d">All regions in all partitions</a></li>
<li><a href="#org6f38c66">Run a command in all regions</a>
<ul>
<li><a href="#org35f50d8">Linear</a></li>
<li><a href="#org10954f5">Parallel</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org015ee64">ACM</a>
<ul>
<li><a href="#orgaf56ddf">list-certificates</a></li>
<li><a href="#orge582349">describe-certificate</a></li>
<li><a href="#org7046c76">get-certificate</a></li>
<li><a href="#orgdb1877e">Get certificate PEM File</a></li>
</ul>
</li>
<li><a href="#orgc0dd0e1">API Gateway V2</a>
<ul>
<li><a href="#orgeb6899e">get-apis</a></li>
</ul>
</li>
<li><a href="#org01b27bf">CloudFormation</a>
<ul>
<li><a href="#org0f3b956">View Stack Log</a></li>
<li><a href="#org1e70677">List Stacks</a></li>
<li><a href="#org8d668ce">Stack Outputs</a></li>
<li><a href="#org05b8482">Get Stack Parameters</a></li>
<li><a href="#orgc5aaa62">Exports</a></li>
<li><a href="#org464bf6a">Spec Files</a></li>
</ul>
</li>
<li><a href="#org099dc4f">CloudWatch</a>
<ul>
<li><a href="#org798084f">Delete All Alarms</a></li>
<li><a href="#orgdab1a9f">Create Alarm Targeting ASG policy</a></li>
</ul>
</li>
<li><a href="#orgac55fec">CodeDeploy</a>
<ul>
<li><a href="#org10d58a9">list-deployments</a></li>
<li><a href="#org5e6a1ee">list-tags-for-resource</a></li>
</ul>
</li>
<li><a href="#orgd109f23">DynamoDB</a>
<ul>
<li><a href="#orgcd484b0">List Tables</a></li>
<li><a href="#orgf86641d">Delete Tables Like a Maniac</a></li>
</ul>
</li>
<li><a href="#org4428828">EC2 AMIs</a>
<ul>
<li><a href="#org2b53905">List AMIs</a></li>
<li><a href="#orgc7ef82e">Get Latest Image</a></li>
<li><a href="#orgc9b362b">Delete AMIs and EBS Snapshots</a></li>
<li><a href="#org69e431f">List Accounts That Can Access AMI</a></li>
</ul>
</li>
<li><a href="#org004791f">EC2 AZs</a>
<ul>
<li><a href="#orgd972451">The Actual AZ</a></li>
</ul>
</li>
<li><a href="#orge786173">EC2 KeyPairs</a>
<ul>
<li><a href="#org86b1c6a">Create</a></li>
<li><a href="#org7584c80">Describe</a></li>
<li><a href="#org82dbef7">Delete</a></li>
</ul>
</li>
<li><a href="#org802dfa8">EC2 Instances</a>
<ul>
<li><a href="#org7cca485">Get Running Instances</a></li>
<li><a href="#orgba14233">Get All Instance Tags</a></li>
<li><a href="#org3fcddfb">Get Instances with Tag Key</a></li>
<li><a href="#org880fa44">Get Instances with Tag Key/Value</a></li>
</ul>
</li>
<li><a href="#orgeb57041">EC2 Transit Gateway</a>
<ul>
<li><a href="#orgdaf548c">List Routes in a TG Route Table</a></li>
</ul>
</li>
<li><a href="#orge5506b4">EC2 VPCs</a>
<ul>
<li><a href="#org85e3a67">VPCs</a></li>
<li><a href="#org2bbb314">Subnets</a></li>
<li><a href="#org094bba0">SecurityGroups</a></li>
<li><a href="#org4bfe151">Private ALB IPs</a></li>
<li><a href="#org6b60942">Managed Prefix Lists</a></li>
</ul>
</li>
<li><a href="#orgb09cc04">EC2 Volumes</a>
<ul>
<li><a href="#org809994b">List Volumes</a></li>
<li><a href="#orgd0a9318">List Unattached Volumes</a></li>
<li><a href="#orge29a71c">Delete Volumes</a></li>
</ul>
</li>
<li><a href="#orgbb03ebe">ECR</a>
<ul>
<li><a href="#orgd6f2beb">Log in</a></li>
<li><a href="#org5b407f7">Create Repository</a></li>
<li><a href="#org1122884">Add Image</a></li>
<li><a href="#org9cd81d3">describe-registry</a></li>
<li><a href="#orgadca32b">describe-repositories</a></li>
<li><a href="#orgb71ddde">list-tags-for-resource</a></li>
</ul>
</li>
<li><a href="#org8d3d512">ECS</a>
<ul>
<li><a href="#orgdcc4f98">list-clusters</a></li>
<li><a href="#orgc613706">describe-clusters</a></li>
<li><a href="#org3c4b26c">describe-services</a></li>
<li><a href="#org39188b3">describe-task-definition</a></li>
<li><a href="#orgb5f9388">descibe-task-sets</a></li>
</ul>
</li>
<li><a href="#org7c0a659">EKS</a>
<ul>
<li><a href="#org902ce68">List Clusters</a></li>
<li><a href="#org07ccf37">Get Kube Config</a></li>
</ul>
</li>
<li><a href="#orga2776ff">Elasticache</a>
<ul>
<li><a href="#org0f79de6">List CacheClusters</a></li>
<li><a href="#org178032d">List ReplicationGroups</a></li>
</ul>
</li>
<li><a href="#orgf2eab5b">ElasticBeanstalk</a>
<ul>
<li><a href="#org3545be4">Config Options for Nampespace</a></li>
</ul>
</li>
<li><a href="#org4f6c1e4">ElasticLoadBalancingV2</a>
<ul>
<li><a href="#orgfe93821">Describe ALBs</a></li>
<li><a href="#org8c78c4c">Get DNS Name</a></li>
</ul>
</li>
<li><a href="#org15cef0e">GlobalAccelerator</a>
<ul>
<li><a href="#orgdcbeffd">List Accelerators</a></li>
<li><a href="#org5318dce">List Listeners</a></li>
<li><a href="#orgf87b5c0">IPs</a></li>
</ul>
</li>
<li><a href="#orgce07388">IAM</a>
<ul>
<li><a href="#org92d8b3d">Create Policy</a></li>
<li><a href="#org29b87dc">Describe Policy</a></li>
<li><a href="#org44188e0">Assume Role</a></li>
<li><a href="#org2ec8d74">List Instance Profiles</a></li>
<li><a href="#org17db863">Delete Instance Profile</a></li>
</ul>
</li>
<li><a href="#orge90e732">IMDS</a></li>
<li><a href="#org524a14d">Kinesis</a>
<ul>
<li><a href="#orgfb070f7">Delete Stream</a></li>
</ul>
</li>
<li><a href="#org447341c">Kinesis Firehose</a>
<ul>
<li><a href="#org538cae4">Describe Stream</a></li>
<li><a href="#org1c25db3">Update Stream S3 Destination Bucket</a></li>
<li><a href="#org9a05898">Update Stream S3 Destination Prefix</a></li>
</ul>
</li>
<li><a href="#org58ab81e">Lambda</a>
<ul>
<li><a href="#org6a93227">Invoke function</a></li>
<li><a href="#org37e6f45">Create Function with Zip File</a></li>
<li><a href="#org1da8806">Update Function code with Zip File</a></li>
<li><a href="#org61177cb">Container Image: Run Interactively</a></li>
</ul>
</li>
<li><a href="#orgdcc0535">Organizations</a></li>
<li><a href="#org77afbd8">Polly</a></li>
<li><a href="#org4f417a6">Reosurce Access Manager (RAM)</a></li>
<li><a href="#orged392ac">RDS</a>
<ul>
<li><a href="#org7f886c4">describe-db-instances</a></li>
<li><a href="#org16b6eae">modify-db-instance</a></li>
<li><a href="#org8f4c0c1">describe-db-engine-versions</a></li>
<li><a href="#org9affadf">pending maintenance actions for a DB</a></li>
<li><a href="#org550d068">create-db-snapshot</a></li>
<li><a href="#org12c6d7c">create-parameter-group</a></li>
<li><a href="#orgee75330">describe-parameter-group</a></li>
</ul>
</li>
<li><a href="#orga7f2e6b">Route53</a>
<ul>
<li><a href="#org9955e19">Get HostedZoneId from domain name</a></li>
<li><a href="#orgd48bc48">List Records for a HostedZone</a></li>
</ul>
</li>
<li><a href="#orgd2c2c24">SageMaker</a>
<ul>
<li><a href="#org11186f0">list-models</a></li>
</ul>
</li>
<li><a href="#org3882600">SecretsManager</a>
<ul>
<li><a href="#org1d541b3">List Secrets</a></li>
<li><a href="#org0b68467">Get Secret</a></li>
<li><a href="#org795edde">Create Secret</a></li>
</ul>
</li>
<li><a href="#org5f3f64c">ServiceCatalog</a>
<ul>
<li><a href="#orgca6e0d5">Get Product IDs</a></li>
<li><a href="#orgad610cf">Launch Product</a></li>
</ul>
</li>
<li><a href="#orgd46de62">Service Quotas</a>
<ul>
<li><a href="#org4b922f7">Get all service quotas</a></li>
<li><a href="#org9bacdde">Get one quota</a></li>
<li><a href="#org5938041">Get default quota</a></li>
</ul>
</li>
<li><a href="#org8cb6e83">S3</a>
<ul>
<li><a href="#orgd915749">Canonical ID</a></li>
<li><a href="#org8437c60">list-buckets</a></li>
<li><a href="#orgb569f97">Create Bucket</a></li>
<li><a href="#org3598548">List Objects</a></li>
<li><a href="#org6660dfd">Get object</a></li>
<li><a href="#org1fddda1">Get multiple objects</a></li>
<li><a href="#org5dacec5">Get Bucket Policy</a></li>
<li><a href="#orgec7aefc">Clear and delete buckets</a></li>
</ul>
</li>
<li><a href="#org154e02e">SNS</a>
<ul>
<li><a href="#org12b98d1">SNS topics</a></li>
</ul>
</li>
<li><a href="#org09ca393">SQS</a>
<ul>
<li><a href="#orgf6f0ddd">List Queues</a></li>
<li><a href="#orgd684c4d">Read Message</a></li>
<li><a href="#org21bfe09">Send Message</a></li>
</ul>
</li>
<li><a href="#orgf97ac30">SSM</a></li>
<li><a href="#org2823b6b">Identity Store (SSO)</a>
<ul>
<li><a href="#org39c2282">Register client</a></li>
<li><a href="#orgf5857a2">Token</a></li>
<li><a href="#org82aff8f">List my accounts</a></li>
<li><a href="#org3bea523">Get credentials</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org794f761" class="outline-2">
<h2 id="org794f761"><a href="#org794f761">Account</a></h2>
<div class="outline-text-2" id="text-org794f761">
<p>
Account number:
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org6b7e2b4">aws sts get-caller-identity \
    --query 'Account' \
    --output text
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f7c126" class="outline-2">
<h2 id="org1f7c126"><a href="#org1f7c126">IP Address Ranges</a></h2>
<div class="outline-text-2" id="text-org1f7c126">
<p>
AWS documentation is <a href="https://docs.aws.amazon.com/general/latest/gr/aws-ip-ranges.html">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org2f6562d">curl -s https://ip-ranges.amazonaws.com/ip-ranges.json
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">cat "$IpRanges" \
    | jq '.prefixes[]
          | select(.region = "us-east-2")
          | .ip_prefix'
</pre>
</div>
</div>

<div id="outline-container-org71c9ae4" class="outline-3">
<h3 id="org71c9ae4"><a href="#org71c9ae4">Get Region of IP</a></h3>
<div class="outline-text-3" id="text-org71c9ae4">
<p>
(Would be cool).
</p>

<p>
Check IP address against each CIDR range. Would be cool to do this using bit
comparisons.
</p>

<p>
See: <a href="https://unix.stackexchange.com/questions/274330/check-ip-is-in-range-of-whitelist-array">https://unix.stackexchange.com/questions/274330/check-ip-is-in-range-of-whitelist-array</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orga2c80b6" class="outline-2">
<h2 id="orga2c80b6"><a href="#orga2c80b6">Regions</a></h2>
<div class="outline-text-2" id="text-orga2c80b6">
</div>
<div id="outline-container-org3b1ae44" class="outline-3">
<h3 id="org3b1ae44"><a href="#org3b1ae44">All regions in partition</a></h3>
<div class="outline-text-3" id="text-org3b1ae44">
<div class="org-src-container">
<pre class="src src-sh" id="orge689a99">aws ec2 describe-regions \
    | jq -r ".Regions[].RegionName"
</pre>
</div>

<p>
Number of regions:
</p>

<div class="org-src-container">
<pre class="src src-sh">echo $AllRegions | wc -w   # Using wc

regions=($AllRegions)      # Or use an array, and
echo ${#regions[*]}        # print array length
</pre>
</div>
</div>
</div>

<div id="outline-container-org87aae0d" class="outline-3">
<h3 id="org87aae0d"><a href="#org87aae0d">All regions in all partitions</a></h3>
<div class="outline-text-3" id="text-org87aae0d">
<p>
Should be in the botocore data files. Also, we can pull them from the IpRanges
document. You have to decide whether "GLOBAL" is a "region" in your situation.
</p>

<div class="org-src-container">
<pre class="src src-sh">cat "$IpRanges" \
    | jq -r '.prefixes[].region' \
    | sort | uniq
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f38c66" class="outline-3">
<h3 id="org6f38c66"><a href="#org6f38c66">Run a command in all regions</a></h3>
<div class="outline-text-3" id="text-org6f38c66">
</div>
<div id="outline-container-org35f50d8" class="outline-4">
<h4 id="org35f50d8"><a href="#org35f50d8">Linear</a></h4>
<div class="outline-text-4" id="text-org35f50d8">
<p>
Get the number of VPCs in each region the slow and simple way.
</p>

<div class="org-src-container">
<pre class="src src-sh">for region in $regions; do
    vpcs=($(aws --region $region ec2 describe-vpcs | jq '.Vpcs[].VpcId'))
    echo "$region: ${#vpcs[*]}"
done
</pre>
</div>
</div>
</div>
