notes/org/aws/commands.org
*** Parallel

    Get the number of VPCs in each region the 🚀 and 😎 (and 🤮) way by starting
    a subprocess for each region in parallel. Note that =${#regions[@]}= is bash
    syntax for the length of the =$regions= array.

    #+header: :var regions=AllRegions
    #+begin_src sh
      script=$(cat <<-"EOF"
      vpcs=($(aws --region {} ec2 describe-vpcs | jq '.Vpcs[].VpcId'))
      echo "{}: ${#vpcs[@]}"
      EOF
      )

      regions=($regions)
      printf "%s\n" "${regions[@]}" \
          | xargs -n 1 \
                  -P ${#regions[*]} \
                  -I {} \
                  bash -c "$script"
    #+end_src

    #+RESULTS:
    : us-east-2: 8
    : ca-central-1: 2
    : eu-south-1: 1
    : eu-west-3: 1
    : us-west-2: 3
    : us-east-1: 97
    : eu-central-1: 1
    : us-west-1: 4
    : eu-north-1: 2
    : eu-west-2: 3
    : eu-west-1: 1
    : sa-east-1: 1
    : ap-northeast-2: 1
    : ap-northeast-1: 2
    : ap-south-1: 1
    : me-south-1: 1
    : ap-east-1: 1
    : ap-northeast-3: 1
    : af-south-1: 1
    : ap-southeast-1: 1
    : ap-southeast-2: 1

* ACM

** list-certificates

   #+begin_src sh
     aws acm list-certificates \
         --includes "keyUsage=ANY" \
         | jq '.CertificateSummaryList[]'
   #+end_src

** describe-certificate

   #+begin_src sh :var cert_arn=""
     aws acm describe-certificate \
         --certificate-arn $cert_arn
   #+end_src

** get-certificate

   #+begin_src sh :var cert_arn=""
     aws acm get-certificate \
         --certificate-arn $cert_arn
   #+end_src

** Get certificate PEM File

   #+begin_src sh :var cert_arn=""
     aws acm get-certificate \
         --certificate-arn $cert_arn \
         | jq -r '.Certificate' > cert.pem
   #+end_src

* API Gateway V2

** get-apis

   #+begin_src sh
     aws apigatewayv2 get-apis \
         | jq '.Items[]'
   #+end_src

* CloudFormation

  For create/deploy/update, see my [[https://github.com/cfclrk/cloudformation/blob/main/README.org][cloudformation/README.org]].

** View Stack Log

   #+begin_src sh
     aws cloudformation list-stacks \
         | jq -M '.StackSummaries[0].StackId' \
         | xargs aws cloudformation describe-stack-events --stack-name
   #+end_src

** List Stacks

   List only the created stacks

   #+begin_src sh
     aws cloudformation list-stacks \
         --stack-status-filter CREATE_IN_PROGRESS CREATE_COMPLETE
   #+end_src

** Stack Outputs

   #+begin_src sh :var StackName="test-network-public"
     aws cloudformation describe-stacks \
         --stack-name $StackName \
         | jq '.Stacks[].Outputs[]'
   #+end_src

   Get the value of a single output:

   #+begin_src sh :var StackName="test-network-public" OutputKey="PublicSubnet1"
     aws cloudformation describe-stacks \
         --stack-name $StackName \
         --query "Stacks[0].Outputs[?OutputKey=='$OutputKey'].OutputValue" \
         --output text
   #+end_src

** Get Stack Parameters

   Get all parameters used to create a particular stack:

   #+begin_src sh :var StackName="test-ec2-instance"
     aws cloudformation describe-stacks \
         --stack-name $StackName \
         | jq '.Stacks[].Parameters[]'
   #+end_src

   Get the value of a single parameter:

   #+begin_src sh :var StackName="test-ec2-instance" Parameter="DeploymentName"
     aws cloudformation describe-stacks \
         --stack-name $StackName \
         --query "Stacks[0].Parameters[?ParameterKey=='$Parameter'].ParameterValue" \
         --output text
   #+end_src

** Exports

   Get value of the exported field with name =$ExportName=:

   #+begin_src sh :var ExportName="test-PublicSubnet1"
     aws cloudformation list-exports \
         --query "Exports[?Name=='$ExportName'].Value" \
         --output text
   #+end_src

   List exports that start with a string:

   #+begin_src sh
     aws cloudformation list-exports \
         --query "Exports[?starts_with(Name, 'foo-')].[Name, Value]" \
         --output text
   #+end_src

** Spec Files

   URLs are documented [[https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/cfn-resource-specification.html][here]].

* CloudWatch

** Delete All Alarms

   #+begin_src sh
     alarms=$(aws cloudwatch describe-alarms \
                  | jq -r '.MetricAlarms[].AlarmName')

     for alarm in $alarms; do
         aws cloudwatch delete-alarms \
             --alarm-names $alarm;
     done
   #+end_src

** Create Alarm Targeting ASG policy

   #+begin_src sh
     aws cloudwatch put-metric-alarm \
         --alarm-name AddCapacity \
         --metric-name CPUUtilization \
         --namespace AWS/EC2 \
         --statistic Average \
         --period 120 \
         --threshold 80 \
         --comparison-operator GreaterThanOrEqualToThreshold \
         --dimensions "Name=AutoScalingGroupName,Value=my-asg" \
         --evaluation-periods 2 \
         --alarm-actions $ScalingPolicyArn
   #+end_src

* CodeDeploy

** list-deployments

   #+begin_src sh
     aws deploy list-deployments \
         --application-name $app
   #+end_src

** list-tags-for-resource

   #+begin_src sh
     aws deploy list-tags-for-resource \
         --resource-arn ""
   #+end_src

* DynamoDB

  The paper: [[https://www.allthingsdistributed.com/files/amazon-dynamo-sosp2007.pdf][Dynamo: Amazon’s Highly Available Key-value Store]]. This describes a
  distributed database with a leaderless replication model.

  From [[https://shop.aer.io/oreilly/p/designing-data-intensive-applications/9781449373320-9149][Designing Data-Intensive Applications]] by Martin Kleppmann:

  #+begin_quote
  Dynamo is not available to users outside of Amazon. Confusingly, AWS offers a
  hosted database product called DynamoDB, which uses a completely different
  architecture: it is based on single-leader replication.
  #+end_quote

** List Tables

   #+begin_src sh
     aws dynamodb  list-tables | jq '.TableNames[]'
   #+end_src

