docs/notes/aws/commands.html

<div id="outline-container-org10954f5" class="outline-4">
<h4 id="org10954f5"><a href="#org10954f5">Parallel</a></h4>
<div class="outline-text-4" id="text-org10954f5">
<p>
Get the number of VPCs in each region the 🚀 and 😎 (and 🤮) way by starting
a subprocess for each region in parallel. Note that <code>${#regions[@]}</code> is bash
syntax for the length of the <code>$regions</code> array.
</p>

<div class="org-src-container">
<pre class="src src-sh">script=$(cat &lt;&lt;-"EOF"
vpcs=($(aws --region {} ec2 describe-vpcs | jq '.Vpcs[].VpcId'))
echo "{}: ${#vpcs[@]}"
EOF
)

regions=($regions)
printf "%s\n" "${regions[@]}" \
    | xargs -n 1 \
            -P ${#regions[*]} \
            -I {} \
            bash -c "$script"
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org015ee64" class="outline-2">
<h2 id="org015ee64"><a href="#org015ee64">ACM</a></h2>
<div class="outline-text-2" id="text-org015ee64">
</div>
<div id="outline-container-orgaf56ddf" class="outline-3">
<h3 id="orgaf56ddf"><a href="#orgaf56ddf">list-certificates</a></h3>
<div class="outline-text-3" id="text-orgaf56ddf">
<div class="org-src-container">
<pre class="src src-sh">aws acm list-certificates \
    --includes "keyUsage=ANY" \
    | jq '.CertificateSummaryList[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-orge582349" class="outline-3">
<h3 id="orge582349"><a href="#orge582349">describe-certificate</a></h3>
<div class="outline-text-3" id="text-orge582349">
<div class="org-src-container">
<pre class="src src-sh">aws acm describe-certificate \
    --certificate-arn $cert_arn
</pre>
</div>
</div>
</div>

<div id="outline-container-org7046c76" class="outline-3">
<h3 id="org7046c76"><a href="#org7046c76">get-certificate</a></h3>
<div class="outline-text-3" id="text-org7046c76">
<div class="org-src-container">
<pre class="src src-sh">aws acm get-certificate \
    --certificate-arn $cert_arn
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb1877e" class="outline-3">
<h3 id="orgdb1877e"><a href="#orgdb1877e">Get certificate PEM File</a></h3>
<div class="outline-text-3" id="text-orgdb1877e">
<div class="org-src-container">
<pre class="src src-sh">aws acm get-certificate \
    --certificate-arn $cert_arn \
    | jq -r '.Certificate' &gt; cert.pem
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc0dd0e1" class="outline-2">
<h2 id="orgc0dd0e1"><a href="#orgc0dd0e1">API Gateway V2</a></h2>
<div class="outline-text-2" id="text-orgc0dd0e1">
</div>
<div id="outline-container-orgeb6899e" class="outline-3">
<h3 id="orgeb6899e"><a href="#orgeb6899e">get-apis</a></h3>
<div class="outline-text-3" id="text-orgeb6899e">
<div class="org-src-container">
<pre class="src src-sh">aws apigatewayv2 get-apis \
    | jq '.Items[]'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org01b27bf" class="outline-2">
<h2 id="org01b27bf"><a href="#org01b27bf">CloudFormation</a></h2>
<div class="outline-text-2" id="text-org01b27bf">
<p>
For create/deploy/update, see my <a href="https://github.com/cfclrk/cloudformation/blob/main/README.org">cloudformation/README.org</a>.
</p>
</div>

<div id="outline-container-org0f3b956" class="outline-3">
<h3 id="org0f3b956"><a href="#org0f3b956">View Stack Log</a></h3>
<div class="outline-text-3" id="text-org0f3b956">
<div class="org-src-container">
<pre class="src src-sh">aws cloudformation list-stacks \
    | jq -M '.StackSummaries[0].StackId' \
    | xargs aws cloudformation describe-stack-events --stack-name
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e70677" class="outline-3">
<h3 id="org1e70677"><a href="#org1e70677">List Stacks</a></h3>
<div class="outline-text-3" id="text-org1e70677">
<p>
List only the created stacks
</p>

<div class="org-src-container">
<pre class="src src-sh">aws cloudformation list-stacks \
    --stack-status-filter CREATE_IN_PROGRESS CREATE_COMPLETE
</pre>
</div>
</div>
</div>

<div id="outline-container-org8d668ce" class="outline-3">
<h3 id="org8d668ce"><a href="#org8d668ce">Stack Outputs</a></h3>
<div class="outline-text-3" id="text-org8d668ce">
<div class="org-src-container">
<pre class="src src-sh">aws cloudformation describe-stacks \
    --stack-name $StackName \
    | jq '.Stacks[].Outputs[]'
</pre>
</div>

<p>
Get the value of a single output:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws cloudformation describe-stacks \
    --stack-name $StackName \
    --query "Stacks[0].Outputs[?OutputKey=='$OutputKey'].OutputValue" \
    --output text
</pre>
</div>
</div>
</div>

<div id="outline-container-org05b8482" class="outline-3">
<h3 id="org05b8482"><a href="#org05b8482">Get Stack Parameters</a></h3>
<div class="outline-text-3" id="text-org05b8482">
<p>
Get all parameters used to create a particular stack:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws cloudformation describe-stacks \
    --stack-name $StackName \
    | jq '.Stacks[].Parameters[]'
</pre>
</div>

<p>
Get the value of a single parameter:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws cloudformation describe-stacks \
    --stack-name $StackName \
    --query "Stacks[0].Parameters[?ParameterKey=='$Parameter'].ParameterValue" \
    --output text
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5aaa62" class="outline-3">
<h3 id="orgc5aaa62"><a href="#orgc5aaa62">Exports</a></h3>
<div class="outline-text-3" id="text-orgc5aaa62">
<p>
Get value of the exported field with name <code>$ExportName</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws cloudformation list-exports \
    --query "Exports[?Name=='$ExportName'].Value" \
    --output text
</pre>
</div>

<p>
List exports that start with a string:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws cloudformation list-exports \
    --query "Exports[?starts_with(Name, 'foo-')].[Name, Value]" \
    --output text
</pre>
</div>
</div>
</div>

<div id="outline-container-org464bf6a" class="outline-3">
<h3 id="org464bf6a"><a href="#org464bf6a">Spec Files</a></h3>
<div class="outline-text-3" id="text-org464bf6a">
<p>
URLs are documented <a href="https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/cfn-resource-specification.html">here</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org099dc4f" class="outline-2">
<h2 id="org099dc4f"><a href="#org099dc4f">CloudWatch</a></h2>
<div class="outline-text-2" id="text-org099dc4f">
</div>
<div id="outline-container-org798084f" class="outline-3">
<h3 id="org798084f"><a href="#org798084f">Delete All Alarms</a></h3>
<div class="outline-text-3" id="text-org798084f">
<div class="org-src-container">
<pre class="src src-sh">alarms=$(aws cloudwatch describe-alarms \
             | jq -r '.MetricAlarms[].AlarmName')

for alarm in $alarms; do
    aws cloudwatch delete-alarms \
        --alarm-names $alarm;
done
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdab1a9f" class="outline-3">
<h3 id="orgdab1a9f"><a href="#orgdab1a9f">Create Alarm Targeting ASG policy</a></h3>
<div class="outline-text-3" id="text-orgdab1a9f">
<div class="org-src-container">
<pre class="src src-sh">aws cloudwatch put-metric-alarm \
    --alarm-name AddCapacity \
    --metric-name CPUUtilization \
    --namespace AWS/EC2 \
    --statistic Average \
    --period 120 \
    --threshold 80 \
    --comparison-operator GreaterThanOrEqualToThreshold \
    --dimensions "Name=AutoScalingGroupName,Value=my-asg" \
    --evaluation-periods 2 \
    --alarm-actions $ScalingPolicyArn
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgac55fec" class="outline-2">
<h2 id="orgac55fec"><a href="#orgac55fec">CodeDeploy</a></h2>
<div class="outline-text-2" id="text-orgac55fec">
</div>
<div id="outline-container-org10d58a9" class="outline-3">
<h3 id="org10d58a9"><a href="#org10d58a9">list-deployments</a></h3>
<div class="outline-text-3" id="text-org10d58a9">
<div class="org-src-container">
<pre class="src src-sh">aws deploy list-deployments \
    --application-name $app
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e6a1ee" class="outline-3">
<h3 id="org5e6a1ee"><a href="#org5e6a1ee">list-tags-for-resource</a></h3>
<div class="outline-text-3" id="text-org5e6a1ee">
<div class="org-src-container">
<pre class="src src-sh">aws deploy list-tags-for-resource \
    --resource-arn ""
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd109f23" class="outline-2">
<h2 id="orgd109f23"><a href="#orgd109f23">DynamoDB</a></h2>
<div class="outline-text-2" id="text-orgd109f23">
<p>
The paper: <a href="https://www.allthingsdistributed.com/files/amazon-dynamo-sosp2007.pdf">Dynamo: Amazon’s Highly Available Key-value Store</a>. This describes a
distributed database with a leaderless replication model.
</p>

<p>
From <a href="https://shop.aer.io/oreilly/p/designing-data-intensive-applications/9781449373320-9149">Designing Data-Intensive Applications</a> by Martin Kleppmann:
</p>

<blockquote>
<p>
Dynamo is not available to users outside of Amazon. Confusingly, AWS offers a
hosted database product called DynamoDB, which uses a completely different
architecture: it is based on single-leader replication.
</p>
</blockquote>
</div>

<div id="outline-container-orgcd484b0" class="outline-3">
<h3 id="orgcd484b0"><a href="#orgcd484b0">List Tables</a></h3>
<div class="outline-text-3" id="text-orgcd484b0">
<div class="org-src-container">
<pre class="src src-sh">aws dynamodb  list-tables | jq '.TableNames[]'
</pre>
</div>
</div>
</div>
