notes/org/aws/commands.org
** Delete Tables Like a Maniac

   AWS allows you to delete have 10 =delete-table= operations running at a time.
   We can create a pool of 10 processes and continuously pump =delete-table=
   commands into it using =xargs=.

   #+begin_src sh
     script=$(cat <<"EOF"
     aws dynamodb delete-table --table-name {}
     aws dynamodb wait table-not-exists --table-name {}
     EOF
           )
     echo ${tables[*]} \
         | xargs -n 1 -P 10 -I {} sh -c "$scrpt"
   #+end_src

   TODO: When I originally wrote this, I remember needing to add a =tr " " "\n"=
   or something for portability with Linux. Test this out again.

   TODO: script used to be one command (using =&&=); test again after splitting
   it into two commands.

* EC2 AMIs

** List AMIs

   All of this account's AMIs:

   #+begin_src sh :var Account=Account
     aws ec2 describe-images --owners $Account
   #+end_src

   All of this account's AMIs with a particular Name tag:

   #+begin_src sh
     aws ec2 describe-images \
         --owners $account \
         --filters "Name=tag:Name,Values=My AMI"
   #+end_src

** Get Latest Image

   #+begin_src sh :var Account=Account
     aws ec2 describe-images \
         --owners $Account \
         --filters "Name=state,Values=available" \
         | jq -r '.Images
                  | sort_by(.CreationDate)
                  | last | .ImageId'
   #+end_src

** Delete AMIs and EBS Snapshots

   List AMIs to delete and set to variable =AmisToDelete=. Then:

   #+begin_src sh :var AMIs=""
     jq -c '.Images
            | sort_by(.CreationDate)
            | .[]
            | {name: .Name, snap: .BlockDeviceMappings[]
            | select(.Ebs != null)
            | .Ebs.SnapshotId}' < $AmisToDelete > images.txt
   #+end_src

   And then... what did I do?

   #+begin_src sh
     for i in (cat images.txt | jq); do
         # deregister image
         # delete the snapshot
     done
   #+end_src

** List Accounts That Can Access AMI

   #+begin_src sh
     aws ec2 describe-image-attribute \
         --image-id $ImageID \
         --attribute launchPermission
   #+end_src

* EC2 AZs

  All AZs in all regions:

  #+header: :var AllRegions=AllRegions
  #+begin_src sh
    for region in $AllRegions; do
        azs=$(aws --region $region \
                  ec2 describe-availability-zones \
                  | jq -c '[.AvailabilityZones[].ZoneName]')
        printf "$region: $azs\n"
    done
  #+end_src

  #+RESULTS:
  : eu-north-1: ["eu-north-1a","eu-north-1b","eu-north-1c"]
  : ap-south-1: ["ap-south-1a","ap-south-1b","ap-south-1c"]
  : eu-west-3: ["eu-west-3a","eu-west-3b","eu-west-3c"]
  : eu-west-2: ["eu-west-2a","eu-west-2b","eu-west-2c"]
  : eu-west-1: ["eu-west-1a","eu-west-1b","eu-west-1c"]
  : ap-northeast-3: ["ap-northeast-3a","ap-northeast-3b","ap-northeast-3c"]
  : ap-northeast-2: ["ap-northeast-2a","ap-northeast-2b","ap-northeast-2c","ap-northeast-2d"]
  : ap-northeast-1: ["ap-northeast-1a","ap-northeast-1c","ap-northeast-1d"]
  : sa-east-1: ["sa-east-1a","sa-east-1b","sa-east-1c"]
  : ca-central-1: ["ca-central-1a","ca-central-1b","ca-central-1d"]
  : ap-southeast-1: ["ap-southeast-1a","ap-southeast-1b","ap-southeast-1c"]
  : ap-southeast-2: ["ap-southeast-2a","ap-southeast-2b","ap-southeast-2c"]
  : eu-central-1: ["eu-central-1a","eu-central-1b","eu-central-1c"]
  : us-east-1: ["us-east-1a","us-east-1b","us-east-1c","us-east-1d","us-east-1e","us-east-1f"]
  : us-east-2: ["us-east-2a","us-east-2b","us-east-2c"]
  : us-west-1: ["us-west-1b","us-west-1c"]
  : us-west-2: ["us-west-2a","us-west-2b","us-west-2c","us-west-2d"]

** The Actual AZ

   =us-east-1b= does not mean the same thing in every AWS account. If everyone
   creates infra in =us-east-1b=, that infra will actually be in several
   different AZs, depending on which AZ =us-east-1b= maps to for each account.
   To determine the /real/ AZ, you need to look at the *Zone ID*.

   Print the Zone Name and Zone ID for each AZ in a region:

   #+begin_src sh
     aws ec2 describe-availability-zones \
         | jq -c '.AvailabilityZones[]
                  | {"Name": .ZoneName, "Id": .ZoneId}'
   #+end_src

   #+RESULTS:
   : {"Name":"us-east-2a","Id":"use2-az1"}
   : {"Name":"us-east-2b","Id":"use2-az2"}
   : {"Name":"us-east-2c","Id":"use2-az3"}

* EC2 KeyPairs

** Create

   #+NAME: KeyPair
   #+header: :var KeyName="test"
   #+begin_src sh
     aws ec2 create-key-pair --key-name $KeyName
   #+end_src

   Copy private key to =~/.ssh=

   #+header: :var KeyPair=KeyPair dir="ironnet"
   #+begin_src bash
     KeyName=$(echo $KeyPair | jq -r '.KeyName')
     KeyFile=~/.ssh/$dir/$KeyName
     echo $KeyPair | jq -r '.KeyMaterial' > $KeyFile
     chmod 0600 $KeyFile
     echo $KeyFile
   #+end_src

** Describe

   #+begin_src sh
     aws ec2 describe-key-pairs | jq '.KeyPairs[]'
   #+end_src

** Delete

   #+begin_src sh :var KeyName="test"
     aws ec2 delete-key-pair --key-name $KeyName
   #+end_src

* EC2 Instances

** Get Running Instances

   #+begin_src sh
     aws ec2 describe-instances \
         --query "Reservations[].Instances[?State.name=="running"]"
   #+end_src

** Get All Instance Tags

   #+begin_src sh
     aws ec2 describe-instances \
         | jq -c '.Reservations[] | .Instances[] | .Tags[]'
   #+end_src

** Get Instances with Tag Key

   With just a specific Tag key, disregarding value:

   #+begin_src sh :var TagName=""
     aws ec2 describe-instances \
         --filter "Name=tag-key,Values=k8s.io/role/node" \
         | jq '.Reservations[].Instances[]'
   #+end_src

** Get Instances with Tag Key/Value

   With just a specific Tag key:

   #+header: :var TagName="Name" TagValue="nodes.zzh.cfc.ironk8s.net"
   #+begin_src sh
     aws ec2 describe-instances \
         --filter "Name=tag:$TagName,Values=$TagValue" \
         | jq -r '.Reservations[].Instances[].Tags[]
                  | select(.Key == "Name")
                  | .Value'
   #+end_src

   With a specific tag key and value

* EC2 Transit Gateway

** List Routes in a TG Route Table

   #+begin_src sh :results output :var TGWRouteTableId=""
     aws --profile shared-services --region us-east-1 \
         ec2 search-transit-gateway-routes \
         --transit-gateway-route-table-id $TGWRouteTableId \
         --filters "Name=type,Values=propagated" \
         | jq -r '.Routes[].DestinationCidrBlock'
   #+end_src

* EC2 VPCs

