docs/notes/aws/commands.html

<div id="outline-container-orgf86641d" class="outline-3">
<h3 id="orgf86641d"><a href="#orgf86641d">Delete Tables Like a Maniac</a></h3>
<div class="outline-text-3" id="text-orgf86641d">
<p>
AWS allows you to delete have 10 <code>delete-table</code> operations running at a time.
We can create a pool of 10 processes and continuously pump <code>delete-table</code>
commands into it using <code>xargs</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">script=$(cat &lt;&lt;"EOF"
aws dynamodb delete-table --table-name {}
aws dynamodb wait table-not-exists --table-name {}
EOF
      )
echo ${tables[*]} \
    | xargs -n 1 -P 10 -I {} sh -c "$scrpt"
</pre>
</div>

<p>
TODO: When I originally wrote this, I remember needing to add a <code>tr " " "\n"</code>
or something for portability with Linux. Test this out again.
</p>

<p>
TODO: script used to be one command (using <code>&amp;&amp;</code>); test again after splitting
it into two commands.
</p>
</div>
</div>
</div>

<div id="outline-container-org4428828" class="outline-2">
<h2 id="org4428828"><a href="#org4428828">EC2 AMIs</a></h2>
<div class="outline-text-2" id="text-org4428828">
</div>
<div id="outline-container-org2b53905" class="outline-3">
<h3 id="org2b53905"><a href="#org2b53905">List AMIs</a></h3>
<div class="outline-text-3" id="text-org2b53905">
<p>
All of this account's AMIs:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-images --owners $Account
</pre>
</div>

<p>
All of this account's AMIs with a particular Name tag:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-images \
    --owners $account \
    --filters "Name=tag:Name,Values=My AMI"
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7ef82e" class="outline-3">
<h3 id="orgc7ef82e"><a href="#orgc7ef82e">Get Latest Image</a></h3>
<div class="outline-text-3" id="text-orgc7ef82e">
<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-images \
    --owners $Account \
    --filters "Name=state,Values=available" \
    | jq -r '.Images
             | sort_by(.CreationDate)
             | last | .ImageId'
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9b362b" class="outline-3">
<h3 id="orgc9b362b"><a href="#orgc9b362b">Delete AMIs and EBS Snapshots</a></h3>
<div class="outline-text-3" id="text-orgc9b362b">
<p>
List AMIs to delete and set to variable <code>AmisToDelete</code>. Then:
</p>

<div class="org-src-container">
<pre class="src src-sh">jq -c '.Images
       | sort_by(.CreationDate)
       | .[]
       | {name: .Name, snap: .BlockDeviceMappings[]
       | select(.Ebs != null)
       | .Ebs.SnapshotId}' &lt; $AmisToDelete &gt; images.txt
</pre>
</div>

<p>
And then&#x2026; what did I do?
</p>

<div class="org-src-container">
<pre class="src src-sh">for i in (cat images.txt | jq); do
    # deregister image
    # delete the snapshot
done
</pre>
</div>
</div>
</div>

<div id="outline-container-org69e431f" class="outline-3">
<h3 id="org69e431f"><a href="#org69e431f">List Accounts That Can Access AMI</a></h3>
<div class="outline-text-3" id="text-org69e431f">
<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-image-attribute \
    --image-id $ImageID \
    --attribute launchPermission
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org004791f" class="outline-2">
<h2 id="org004791f"><a href="#org004791f">EC2 AZs</a></h2>
<div class="outline-text-2" id="text-org004791f">
<p>
All AZs in all regions:
</p>

<div class="org-src-container">
<pre class="src src-sh">for region in $AllRegions; do
    azs=$(aws --region $region \
              ec2 describe-availability-zones \
              | jq -c '[.AvailabilityZones[].ZoneName]')
    printf "$region: $azs\n"
done
</pre>
</div>
</div>

<div id="outline-container-orgd972451" class="outline-3">
<h3 id="orgd972451"><a href="#orgd972451">The Actual AZ</a></h3>
<div class="outline-text-3" id="text-orgd972451">
<p>
<code>us-east-1b</code> does not mean the same thing in every AWS account. If everyone
creates infra in <code>us-east-1b</code>, that infra will actually be in several
different AZs, depending on which AZ <code>us-east-1b</code> maps to for each account.
To determine the <i>real</i> AZ, you need to look at the <b>Zone ID</b>.
</p>

<p>
Print the Zone Name and Zone ID for each AZ in a region:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-availability-zones \
    | jq -c '.AvailabilityZones[]
             | {"Name": .ZoneName, "Id": .ZoneId}'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge786173" class="outline-2">
<h2 id="orge786173"><a href="#orge786173">EC2 KeyPairs</a></h2>
<div class="outline-text-2" id="text-orge786173">
</div>
<div id="outline-container-org86b1c6a" class="outline-3">
<h3 id="org86b1c6a"><a href="#org86b1c6a">Create</a></h3>
<div class="outline-text-3" id="text-org86b1c6a">
<div class="org-src-container">
<pre class="src src-sh" id="org2e3517b">aws ec2 create-key-pair --key-name $KeyName
</pre>
</div>

<p>
Copy private key to <code>~/.ssh</code>
</p>

<div class="org-src-container">
<pre class="src src-bash">KeyName=$(echo $KeyPair | jq -r '.KeyName')
KeyFile=~/.ssh/$dir/$KeyName
echo $KeyPair | jq -r '.KeyMaterial' &gt; $KeyFile
chmod 0600 $KeyFile
echo $KeyFile
</pre>
</div>
</div>
</div>

<div id="outline-container-org7584c80" class="outline-3">
<h3 id="org7584c80"><a href="#org7584c80">Describe</a></h3>
<div class="outline-text-3" id="text-org7584c80">
<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-key-pairs | jq '.KeyPairs[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-org82dbef7" class="outline-3">
<h3 id="org82dbef7"><a href="#org82dbef7">Delete</a></h3>
<div class="outline-text-3" id="text-org82dbef7">
<div class="org-src-container">
<pre class="src src-sh">aws ec2 delete-key-pair --key-name $KeyName
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org802dfa8" class="outline-2">
<h2 id="org802dfa8"><a href="#org802dfa8">EC2 Instances</a></h2>
<div class="outline-text-2" id="text-org802dfa8">
</div>
<div id="outline-container-org7cca485" class="outline-3">
<h3 id="org7cca485"><a href="#org7cca485">Get Running Instances</a></h3>
<div class="outline-text-3" id="text-org7cca485">
<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-instances \
    --query "Reservations[].Instances[?State.name=="running"]"
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba14233" class="outline-3">
<h3 id="orgba14233"><a href="#orgba14233">Get All Instance Tags</a></h3>
<div class="outline-text-3" id="text-orgba14233">
<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-instances \
    | jq -c '.Reservations[] | .Instances[] | .Tags[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fcddfb" class="outline-3">
<h3 id="org3fcddfb"><a href="#org3fcddfb">Get Instances with Tag Key</a></h3>
<div class="outline-text-3" id="text-org3fcddfb">
<p>
With just a specific Tag key, disregarding value:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-instances \
    --filter "Name=tag-key,Values=k8s.io/role/node" \
    | jq '.Reservations[].Instances[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-org880fa44" class="outline-3">
<h3 id="org880fa44"><a href="#org880fa44">Get Instances with Tag Key/Value</a></h3>
<div class="outline-text-3" id="text-org880fa44">
<p>
With just a specific Tag key:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-instances \
    --filter "Name=tag:$TagName,Values=$TagValue" \
    | jq -r '.Reservations[].Instances[].Tags[]
             | select(.Key == "Name")
             | .Value'
</pre>
</div>

<p>
With a specific tag key and value
</p>
</div>
</div>
</div>

<div id="outline-container-orgeb57041" class="outline-2">
<h2 id="orgeb57041"><a href="#orgeb57041">EC2 Transit Gateway</a></h2>
<div class="outline-text-2" id="text-orgeb57041">
</div>
<div id="outline-container-orgdaf548c" class="outline-3">
<h3 id="orgdaf548c"><a href="#orgdaf548c">List Routes in a TG Route Table</a></h3>
<div class="outline-text-3" id="text-orgdaf548c">
<div class="org-src-container">
<pre class="src src-sh">aws --profile shared-services --region us-east-1 \
    ec2 search-transit-gateway-routes \
    --transit-gateway-route-table-id $TGWRouteTableId \
    --filters "Name=type,Values=propagated" \
    | jq -r '.Routes[].DestinationCidrBlock'
</pre>
</div>
</div>
</div>
</div>
