notes/org/aws/commands.org
** VPCs

   #+begin_src bash
     aws ec2 describe-vpcs | jq '.Vpcs[]'
   #+end_src

   The names of VPCs that have a =Name= tag:

   #+begin_src sh
     aws ec2 describe-vpcs \
         --filters Name=tag-key,Values=Name \
         | jq -r '.Vpcs[].Tags[]
                  | select(.Key == "Name")
                  | .Value'
   #+end_src

** Subnets

   #+begin_src sh
     aws ec2 describe-subnets  | jq '.Subnets'
   #+end_src

** SecurityGroups

   #+begin_src sh
     aws ec2 describe-security-groups \
         | jq '.SecurityGroups'
   #+end_src

** Private ALB IPs

   #+begin_src sh
     aws ec2 describe-network-interfaces \
         | jq -r '.NetworkInterfaces[]
               | select(.Attachment.InstanceOwnerId == "amazon-elb")
               | .PrivateIpAddress'
   #+end_src

** Managed Prefix Lists

   #+begin_src sh
     aws ec2 describe-managed-prefix-lists \
         | jq '.PrefixLists[]'
   #+end_src

   #+header :var PrefixListID=""
   #+begin_src sh
     aws ec2 get-managed-prefix-list-entries \
         --prefix-list-id $PrefixListID \
         | jq '.Entries[]'
   #+end_src

* EC2 Volumes

** List Volumes

   #+NAME: AllVolumes
   #+header: :var Tag="kubernetes.io/cluster/steger1018test1"
   #+begin_src sh
     aws ec2 describe-volumes \
         --filters Name=tag-key,Values=$Tag \
         | jq -r '.Volumes[].VolumeId'
   #+end_src

** List Unattached Volumes

   #+NAME: UnattachedVolumes
   #+begin_src sh
     aws ec2 describe-volumes \
         --filters Name=status,Values=available \
         | jq -r '.Volumes[].VolumeId'
   #+end_src

** Delete Volumes

   #+header: :var Volumes=UnattachedVolumes
   #+begin_src sh
     for volume in $Volumes; do
         aws ec2 delete-volume --volume-id $volume
     done
   #+end_src

* ECR

** Log in

   TODO: =$account= doesn't work (newline)

   #+header: :var account=Account
   #+begin_src sh
     ecr=$account.dkr.ecr.$AWS_DEFAULT_REGION.amazonaws.com
     pw=$(aws ecr get-login-password)
     docker login \
            --username AWS \
            --password "$pw" \
            "https://$ecr"
   #+end_src

** Create Repository

   #+header: :var repoName="foo"
   #+begin_src sh
     aws ecr create-repository \
         --repository-name $repoName \
         --tags "Key=Foo,Value=True"
   #+end_src

** Add Image

   Tag image for ECR:

   #+header: :var image="k8s.gcr.io/sig-storage/livenessprobe"
   #+header: :var tag="v2.2.0"
   #+header: :var account=Account
   #+header: :var name="sig-storage-livenessprobe"
   #+begin_src sh
     ecr=$account.dkr.ecr.$AWS_DEFAULT_REGION.amazonaws.com
     docker tag \
            $image:$tag \
            $ecr/$name:$tag
   #+end_src

   Push it:

   #+header: :var tag="v2.2.0"
   #+header: :var account=Account
   #+begin_src sh
     ecr=$account.dkr.ecr.$AWS_DEFAULT_REGION.amazonaws.com
     docker push \
            $ecr/$name:$tag
   #+end_src

** describe-registry

   #+begin_src sh
     aws ecr describe-registry
   #+end_src

** describe-repositories

   #+begin_src sh
     aws ecr describe-repositories \
         --registry-id "<id>"
   #+end_src

** list-tags-for-resource

   The ARN is like =arn:aws:ecr:us-east-1:<account-num>:repository/<repo-name>=.

   #+header: :var arn=""
   #+begin_src sh
     aws ecr list-tags-for-resource \
         --resource-arn "$arn"
   #+end_src

* ECS

  Fix a CloudFormation deployment where an ECS service fails to stabilize. Taken
  from [[https://aws.amazon.com/premiumsupport/knowledge-center/cloudformation-ecs-service-stabilize/][this]] AWS blog post. Just updates the number of ECS service tasks to 0.

  #+header: :var cluster="my-cluster"
  #+header: :var service="my-service"
  #+begin_src sh
    aws ecs update-service \
        --cluster $cluster \
        --service $service \
        --desired-count 0
  #+end_src

** restart tasks

   #+begin_src sh
     aws ecs \
         update-service \
         --force-new-deployment \
         --service $service_name \
         --cluster $cluster_name
   #+end_src

** list-clusters

   #+begin_src sh
     aws ecs list-clusters \
         | jq '.clusterArns[]'
   #+end_src

** describe-clusters

   #+header: :var cluster="prod-zone-service-cluster"
   #+begin_src sh
     aws ecs describe-clusters \
         --clusters $cluster \
         | jq '.clusters[]'
   #+end_src

** describe-services

   #+header: :var cluster="prod-zone-service-cluster"
   #+header: :var service="service-prod"
   #+begin_src sh
     aws ecs describe-services \
         --cluster $cluster \
         --services $service \
         | jq '.services[]'
   #+end_src

** describe-task-definition

   #+header: :var task="sevice-prod:132"
   #+begin_src sh
     aws ecs describe-task-definition \
         --task-definition $task \
         | jq '.taskDefinition.containerDefinitions[]'
   #+end_src

** descibe-task-sets

   #+name: TaskSet
   #+header: :var cluster="prod-zone-service-cluster"
   #+header: :var service="service-prod"
   #+begin_src sh
     aws ecs describe-services \
         --cluster $cluster \
         --services $service \
         | jq -r '.services[].taskSets[].id'
   #+end_src

   #+header: :var cluster="prod-zone-service-cluster"
   #+header: :var service="service-prod"
   #+header: :var task_set=TaskSet
   #+begin_src sh
     aws ecs describe-task-sets \
         --cluster $cluster \
         --service $service \
         --task-sets $task_set \
         | jq '.taskSets[]'
   #+end_src

* EKS

** List Clusters

   #+begin_src sh
     aws eks list-clusters | jq '.clusters[]'
   #+end_src

** Get Kube Config

   #+begin_src sh :var CLUSTER_NAME="eks-ka"
     KUBECONFIG=~/.kube/ironnet_clusters/$CLUSTER_NAME
     aws eks update-kubeconfig \
         --name $CLUSTER_NAME \
         --kubeconfig $KUBECONFIG
   #+end_src

* Elasticache

