docs/notes/aws/commands.html

<div id="outline-container-orge5506b4" class="outline-2">
<h2 id="orge5506b4"><a href="#orge5506b4">EC2 VPCs</a></h2>
<div class="outline-text-2" id="text-orge5506b4">
</div>
<div id="outline-container-org85e3a67" class="outline-3">
<h3 id="org85e3a67"><a href="#org85e3a67">VPCs</a></h3>
<div class="outline-text-3" id="text-org85e3a67">
<div class="org-src-container">
<pre class="src src-bash">aws ec2 describe-vpcs | jq '.Vpcs[]'
</pre>
</div>

<p>
The names of VPCs that have a <code>Name</code> tag:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-vpcs \
    --filters Name=tag-key,Values=Name \
    | jq -r '.Vpcs[].Tags[]
             | select(.Key == "Name")
             | .Value'
</pre>
</div>
</div>
</div>

<div id="outline-container-org2bbb314" class="outline-3">
<h3 id="org2bbb314"><a href="#org2bbb314">Subnets</a></h3>
<div class="outline-text-3" id="text-org2bbb314">
<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-subnets  | jq '.Subnets'
</pre>
</div>
</div>
</div>

<div id="outline-container-org094bba0" class="outline-3">
<h3 id="org094bba0"><a href="#org094bba0">SecurityGroups</a></h3>
<div class="outline-text-3" id="text-org094bba0">
<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-security-groups \
    | jq '.SecurityGroups'
</pre>
</div>
</div>
</div>

<div id="outline-container-org4bfe151" class="outline-3">
<h3 id="org4bfe151"><a href="#org4bfe151">Private ALB IPs</a></h3>
<div class="outline-text-3" id="text-org4bfe151">
<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-network-interfaces \
    | jq -r '.NetworkInterfaces[]
          | select(.Attachment.InstanceOwnerId == "amazon-elb")
          | .PrivateIpAddress'
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b60942" class="outline-3">
<h3 id="org6b60942"><a href="#org6b60942">Managed Prefix Lists</a></h3>
<div class="outline-text-3" id="text-org6b60942">
<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-managed-prefix-lists \
    | jq '.PrefixLists[]'
</pre>
</div>

<p>
#+header :var PrefixListID=""
</p>
<div class="org-src-container">
<pre class="src src-sh">aws ec2 get-managed-prefix-list-entries \
    --prefix-list-id $PrefixListID \
    | jq '.Entries[]'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb09cc04" class="outline-2">
<h2 id="orgb09cc04"><a href="#orgb09cc04">EC2 Volumes</a></h2>
<div class="outline-text-2" id="text-orgb09cc04">
</div>
<div id="outline-container-org809994b" class="outline-3">
<h3 id="org809994b"><a href="#org809994b">List Volumes</a></h3>
<div class="outline-text-3" id="text-org809994b">
<div class="org-src-container">
<pre class="src src-sh" id="org63bbbaa">aws ec2 describe-volumes \
    --filters Name=tag-key,Values=$Tag \
    | jq -r '.Volumes[].VolumeId'
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0a9318" class="outline-3">
<h3 id="orgd0a9318"><a href="#orgd0a9318">List Unattached Volumes</a></h3>
<div class="outline-text-3" id="text-orgd0a9318">
<div class="org-src-container">
<pre class="src src-sh" id="org941bb05">aws ec2 describe-volumes \
    --filters Name=status,Values=available \
    | jq -r '.Volumes[].VolumeId'
</pre>
</div>
</div>
</div>

<div id="outline-container-orge29a71c" class="outline-3">
<h3 id="orge29a71c"><a href="#orge29a71c">Delete Volumes</a></h3>
<div class="outline-text-3" id="text-orge29a71c">
<div class="org-src-container">
<pre class="src src-sh">for volume in $Volumes; do
    aws ec2 delete-volume --volume-id $volume
done
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbb03ebe" class="outline-2">
<h2 id="orgbb03ebe"><a href="#orgbb03ebe">ECR</a></h2>
<div class="outline-text-2" id="text-orgbb03ebe">
</div>
<div id="outline-container-orgd6f2beb" class="outline-3">
<h3 id="orgd6f2beb"><a href="#orgd6f2beb">Log in</a></h3>
<div class="outline-text-3" id="text-orgd6f2beb">
<p>
TODO: <code>$account</code> doesn't work (newline)
</p>

<div class="org-src-container">
<pre class="src src-sh">ecr=$account.dkr.ecr.$AWS_DEFAULT_REGION.amazonaws.com
pw=$(aws ecr get-login-password)
docker login \
       --username AWS \
       --password "$pw" \
       "https://$ecr"
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b407f7" class="outline-3">
<h3 id="org5b407f7"><a href="#org5b407f7">Create Repository</a></h3>
<div class="outline-text-3" id="text-org5b407f7">
<div class="org-src-container">
<pre class="src src-sh">aws ecr create-repository \
    --repository-name $repoName \
    --tags "Key=Foo,Value=True"
</pre>
</div>
</div>
</div>

<div id="outline-container-org1122884" class="outline-3">
<h3 id="org1122884"><a href="#org1122884">Add Image</a></h3>
<div class="outline-text-3" id="text-org1122884">
<p>
Tag image for ECR:
</p>

<div class="org-src-container">
<pre class="src src-sh">ecr=$account.dkr.ecr.$AWS_DEFAULT_REGION.amazonaws.com
docker tag \
       $image:$tag \
       $ecr/$name:$tag
</pre>
</div>

<p>
Push it:
</p>

<div class="org-src-container">
<pre class="src src-sh">ecr=$account.dkr.ecr.$AWS_DEFAULT_REGION.amazonaws.com
docker push \
       $ecr/$name:$tag
</pre>
</div>
</div>
</div>

<div id="outline-container-org9cd81d3" class="outline-3">
<h3 id="org9cd81d3"><a href="#org9cd81d3">describe-registry</a></h3>
<div class="outline-text-3" id="text-org9cd81d3">
<div class="org-src-container">
<pre class="src src-sh">aws ecr describe-registry
</pre>
</div>
</div>
</div>

<div id="outline-container-orgadca32b" class="outline-3">
<h3 id="orgadca32b"><a href="#orgadca32b">describe-repositories</a></h3>
<div class="outline-text-3" id="text-orgadca32b">
<div class="org-src-container">
<pre class="src src-sh">aws ecr describe-repositories \
    --registry-id "&lt;id&gt;"
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb71ddde" class="outline-3">
<h3 id="orgb71ddde"><a href="#orgb71ddde">list-tags-for-resource</a></h3>
<div class="outline-text-3" id="text-orgb71ddde">
<p>
The ARN is like <code>arn:aws:ecr:us-east-1:&lt;account-num&gt;:repository/&lt;repo-name&gt;</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">aws ecr list-tags-for-resource \
    --resource-arn "$arn"
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8d3d512" class="outline-2">
<h2 id="org8d3d512"><a href="#org8d3d512">ECS</a></h2>
<div class="outline-text-2" id="text-org8d3d512">
<p>
Fix a CloudFormation deployment where an ECS service fails to stabilize. Taken
from <a href="https://aws.amazon.com/premiumsupport/knowledge-center/cloudformation-ecs-service-stabilize/">this</a> AWS blog post. Just updates the number of ECS service tasks to 0.
</p>

<div class="org-src-container">
<pre class="src src-sh">aws ecs update-service \
    --cluster $cluster \
    --service $service \
    --desired-count 0
</pre>
</div>
</div>

<div id="outline-container-orgdcc4f98" class="outline-3">
<h3 id="orgdcc4f98"><a href="#orgdcc4f98">list-clusters</a></h3>
<div class="outline-text-3" id="text-orgdcc4f98">
<div class="org-src-container">
<pre class="src src-sh">aws ecs list-clusters \
    | jq '.clusterArns[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc613706" class="outline-3">
<h3 id="orgc613706"><a href="#orgc613706">describe-clusters</a></h3>
<div class="outline-text-3" id="text-orgc613706">
<div class="org-src-container">
<pre class="src src-sh">aws ecs describe-clusters \
    --clusters $cluster \
    | jq '.clusters[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-org3c4b26c" class="outline-3">
<h3 id="org3c4b26c"><a href="#org3c4b26c">describe-services</a></h3>
<div class="outline-text-3" id="text-org3c4b26c">
<div class="org-src-container">
<pre class="src src-sh">aws ecs describe-services \
    --cluster $cluster \
    --services $service \
    | jq '.services[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-org39188b3" class="outline-3">
<h3 id="org39188b3"><a href="#org39188b3">describe-task-definition</a></h3>
<div class="outline-text-3" id="text-org39188b3">
<div class="org-src-container">
<pre class="src src-sh">aws ecs describe-task-definition \
    --task-definition $task \
    | jq '.taskDefinition.containerDefinitions[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5f9388" class="outline-3">
<h3 id="orgb5f9388"><a href="#orgb5f9388">descibe-task-sets</a></h3>
<div class="outline-text-3" id="text-orgb5f9388">
<div class="org-src-container">
<pre class="src src-sh" id="org32b4c6d">aws ecs describe-services \
    --cluster $cluster \
    --services $service \
    | jq -r '.services[].taskSets[].id'
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">aws ecs describe-task-sets \
    --cluster $cluster \
    --service $service \
    --task-sets $task_set \
    | jq '.taskSets[]'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7c0a659" class="outline-2">
<h2 id="org7c0a659"><a href="#org7c0a659">EKS</a></h2>
<div class="outline-text-2" id="text-org7c0a659">
</div>
<div id="outline-container-org902ce68" class="outline-3">
<h3 id="org902ce68"><a href="#org902ce68">List Clusters</a></h3>
<div class="outline-text-3" id="text-org902ce68">
<div class="org-src-container">
<pre class="src src-sh">aws eks list-clusters | jq '.clusters[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-org07ccf37" class="outline-3">
<h3 id="org07ccf37"><a href="#org07ccf37">Get Kube Config</a></h3>
<div class="outline-text-3" id="text-org07ccf37">
<div class="org-src-container">
<pre class="src src-sh">KUBECONFIG=~/.kube/ironnet_clusters/$CLUSTER_NAME
aws eks update-kubeconfig \
    --name $CLUSTER_NAME \
    --kubeconfig $KUBECONFIG
</pre>
</div>
</div>
</div>
</div>
