notes/org/aws/commands.org
** List CacheClusters

   #+begin_src sh
     aws elasticache describe-cache-clusters \
         --show-cache-node-info \
         | jq '.CacheClusters'
   #+end_src

** List ReplicationGroups

   #+begin_src sh
     aws elasticache describe-replication-groups
             | jq '.ReplicationGroups'
   #+end_src

* ElasticBeanstalk

** Config Options for Nampespace

   #+begin_src sh
     aws elasticbeanstalk describe-configuration-options \
         | jq '.Options[]
               | if .Namespace == "aws:autoscaling:launchconfiguration"
                 then .
                 else null
                 end'
   #+end_src

* ElasticLoadBalancingV2

** Describe ALBs

   #+begin_src sh
     aws elbv2 describe-load-balancers \
         | jq '.LoadBalancers[] | select(.Type == "application")'
   #+end_src

** Get DNS Name

   #+begin_src sh
     aws elbv2 describe-load-balancers \
         | jq -r --arg DEPLOYMENT_NAME "$DEPLOYMENT_NAME" \
              '.LoadBalancers[]
               | select(.Type == "application")
               | select(.LoadBalancerName
               | startswith($DEPLOYMENT_NAME))
               | .DNSName'
   #+end_src

* GlobalAccelerator

  GlobalAccelerator is only in =us-west-2=, so set the region explicitly.

** List Accelerators

   #+begin_src sh
     aws --region us-west-2 \
         globalaccelerator list-accelerators \
         | jq '.Accelerators[]'
   #+end_src

** List Listeners

   #+begin_src sh :var AcceleratorArn=""
     aws --region us-west-2 \
         globalaccelerator list-listeners \
         --accelerator-arn $AcceleratorArn
   #+end_src

** IPs

   #+begin_src sh
     aws --region us-west-2 \
         globalaccelerator list-accelerators \
         | jq -r '.Accelerators[].IpSets[].IpAddresses[]'
   #+end_src

* IAM

** Create Policy

   #+header: :var PolicyName="chris-clark-test"
   #+begin_src sh
     aws iam create-policy \
         --policy-name $PolicyName \
         --policy-document '{
       "Version": "2012-10-17",
       "Statement": [{
         "Effect": "Allow",
         "Action": [
           "secretsmanager:GetSecretValue",
           "secretsmanager:DescribeSecret"
         ],
         "Resource": [
           "arn:*:secretsmanager:*:*:secret:MySecret"
         ]
       }]
     }'
   #+end_src

** Describe Policy

   #+begin_src sh
     aws iam get-policy --policy-arn $arn
   #+end_src

** Assume Role

   #+NAME: RoleCreds
   #+begin_src sh
     aws sts assume-role \
         --role-session-name foo \
         --role-arn $RoleArn
   #+end_src

** List Instance Profiles

   #+begin_src sh
     aws iam list-instance-profiles \
         | jq '.InstanceProfiles[].InstanceProfileName'
   #+end_src

** Delete Instance Profile

   #+begin_src sh :var Name=""
     aws iam delete-instance-profile \
         --instance-profile-name $Name
   #+end_src

* IMDS

  http://169.254.169.254/latest/meta-data/

* Kinesis

** Delete Stream

   #+begin_src sh
     aws kinesis delete-stream --stream-name $stream
   #+end_src

* Kinesis Firehose

** Describe Stream

   #+begin_src sh :var StreamName=""
     aws firehose describe-delivery-stream \
         --delivery-stream-name $StreamName \
         | jq '.DeliveryStreamDescription'
   #+end_src

** Update Stream S3 Destination Bucket

   #+begin_src sh :var StreamName="" BucketName="example"
     aws firehose update-destination \
         --delivery-stream-name $StreamName \
         --current-delivery-stream-version-id 1 \
         --destination-id destinationId-000000000001 \
         --extended-s3-destination-update \
         BucketARN=arn:aws:s3:::$BucketName
   #+end_src

   THEN:

   - Update the Stream's IAM policy to allow it to write to the new location
   - Update the S3 Bucket Policy to allow the Stream's IAM Role to write to it

** Update Stream S3 Destination Prefix

   #+begin_src sh :var StreamName="" Prefix="firehose/example/"
     aws firehose update-destination \
         --delivery-stream-name $StreamName \
         --current-delivery-stream-version-id 1 \
         --destination-id destinationId-000000000001 \
         --extended-s3-destination-update Prefix=$Prefix
   #+end_src

   Also may need to update the IAM Policy and the S3 Bucket policy, as above.

* Lambda

** Invoke function

   #+begin_src bash
     aws lambda invoke \
         --cli-binary-format raw-in-base64-out \
         --function-name cf-Hello-World \
         /tmp/cats.json
   #+end_src

   Invoke from a bastion host:

   #+header: :dir /ssh:ec2-user@13.59.90.58|ssh:ec2-user@10.192.20.15:/
   #+begin_src bash :results output
     /usr/local/bin/aws lambda invoke \
                        --cli-binary-format raw-in-base64-out \
                        --function-name cf-Hello-World \
                        /tmp/cats.json
   #+end_src

   #+begin_src sh
     cat /tmp/out.json | jq -r '.body' | jq
   #+end_src

   With payload file:

   #+begin_src bash
     aws lambda invoke \
         --cli-binary-format raw-in-base64-out \
         --function-name hello-world \
         --payload file://tests/resources/event_alb.json \
         /tmp/out.json
   #+end_src

** Create Function with Zip File

   #+begin_src sh
     aws lambda create-function \
         --function-name artifacttool \
         --runtime python2.7 \
         --role $RoleArn \
         --handler lambda_function.lambda_handler \
         --zip-file fileb://$ZipFileName
   #+end_src

