docs/notes/aws/commands.html

<div id="outline-container-orga2776ff" class="outline-2">
<h2 id="orga2776ff"><a href="#orga2776ff">Elasticache</a></h2>
<div class="outline-text-2" id="text-orga2776ff">
</div>
<div id="outline-container-org0f79de6" class="outline-3">
<h3 id="org0f79de6"><a href="#org0f79de6">List CacheClusters</a></h3>
<div class="outline-text-3" id="text-org0f79de6">
<div class="org-src-container">
<pre class="src src-sh">aws elasticache describe-cache-clusters \
    --show-cache-node-info \
    | jq '.CacheClusters'
</pre>
</div>
</div>
</div>

<div id="outline-container-org178032d" class="outline-3">
<h3 id="org178032d"><a href="#org178032d">List ReplicationGroups</a></h3>
<div class="outline-text-3" id="text-org178032d">
<div class="org-src-container">
<pre class="src src-sh">aws elasticache describe-replication-groups
        | jq '.ReplicationGroups'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf2eab5b" class="outline-2">
<h2 id="orgf2eab5b"><a href="#orgf2eab5b">ElasticBeanstalk</a></h2>
<div class="outline-text-2" id="text-orgf2eab5b">
</div>
<div id="outline-container-org3545be4" class="outline-3">
<h3 id="org3545be4"><a href="#org3545be4">Config Options for Nampespace</a></h3>
<div class="outline-text-3" id="text-org3545be4">
<div class="org-src-container">
<pre class="src src-sh">aws elasticbeanstalk describe-configuration-options \
    | jq '.Options[]
          | if .Namespace == "aws:autoscaling:launchconfiguration"
            then .
            else null
            end'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4f6c1e4" class="outline-2">
<h2 id="org4f6c1e4"><a href="#org4f6c1e4">ElasticLoadBalancingV2</a></h2>
<div class="outline-text-2" id="text-org4f6c1e4">
</div>
<div id="outline-container-orgfe93821" class="outline-3">
<h3 id="orgfe93821"><a href="#orgfe93821">Describe ALBs</a></h3>
<div class="outline-text-3" id="text-orgfe93821">
<div class="org-src-container">
<pre class="src src-sh">aws elbv2 describe-load-balancers \
    | jq '.LoadBalancers[] | select(.Type == "application")'
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c78c4c" class="outline-3">
<h3 id="org8c78c4c"><a href="#org8c78c4c">Get DNS Name</a></h3>
<div class="outline-text-3" id="text-org8c78c4c">
<div class="org-src-container">
<pre class="src src-sh">aws elbv2 describe-load-balancers \
    | jq -r --arg DEPLOYMENT_NAME "$DEPLOYMENT_NAME" \
         '.LoadBalancers[]
          | select(.Type == "application")
          | select(.LoadBalancerName
          | startswith($DEPLOYMENT_NAME))
          | .DNSName'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org15cef0e" class="outline-2">
<h2 id="org15cef0e"><a href="#org15cef0e">GlobalAccelerator</a></h2>
<div class="outline-text-2" id="text-org15cef0e">
<p>
GlobalAccelerator is only in <code>us-west-2</code>, so set the region explicitly.
</p>
</div>

<div id="outline-container-orgdcbeffd" class="outline-3">
<h3 id="orgdcbeffd"><a href="#orgdcbeffd">List Accelerators</a></h3>
<div class="outline-text-3" id="text-orgdcbeffd">
<div class="org-src-container">
<pre class="src src-sh">aws --region us-west-2 \
    globalaccelerator list-accelerators \
    | jq '.Accelerators[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-org5318dce" class="outline-3">
<h3 id="org5318dce"><a href="#org5318dce">List Listeners</a></h3>
<div class="outline-text-3" id="text-org5318dce">
<div class="org-src-container">
<pre class="src src-sh">aws --region us-west-2 \
    globalaccelerator list-listeners \
    --accelerator-arn $AcceleratorArn
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf87b5c0" class="outline-3">
<h3 id="orgf87b5c0"><a href="#orgf87b5c0">IPs</a></h3>
<div class="outline-text-3" id="text-orgf87b5c0">
<div class="org-src-container">
<pre class="src src-sh">aws --region us-west-2 \
    globalaccelerator list-accelerators \
    | jq -r '.Accelerators[].IpSets[].IpAddresses[]'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgce07388" class="outline-2">
<h2 id="orgce07388"><a href="#orgce07388">IAM</a></h2>
<div class="outline-text-2" id="text-orgce07388">
</div>
<div id="outline-container-org92d8b3d" class="outline-3">
<h3 id="org92d8b3d"><a href="#org92d8b3d">Create Policy</a></h3>
<div class="outline-text-3" id="text-org92d8b3d">
<div class="org-src-container">
<pre class="src src-sh">aws iam create-policy \
    --policy-name $PolicyName \
    --policy-document '{
  "Version": "2012-10-17",
  "Statement": [{
    "Effect": "Allow",
    "Action": [
      "secretsmanager:GetSecretValue",
      "secretsmanager:DescribeSecret"
    ],
    "Resource": [
      "arn:*:secretsmanager:*:*:secret:MySecret"
    ]
  }]
}'
</pre>
</div>
</div>
</div>

<div id="outline-container-org29b87dc" class="outline-3">
<h3 id="org29b87dc"><a href="#org29b87dc">Describe Policy</a></h3>
<div class="outline-text-3" id="text-org29b87dc">
<div class="org-src-container">
<pre class="src src-sh">aws iam get-policy --policy-arn $arn
</pre>
</div>
</div>
</div>

<div id="outline-container-org44188e0" class="outline-3">
<h3 id="org44188e0"><a href="#org44188e0">Assume Role</a></h3>
<div class="outline-text-3" id="text-org44188e0">
<div class="org-src-container">
<pre class="src src-sh" id="org1e27212">aws sts assume-role \
    --role-session-name foo \
    --role-arn $RoleArn
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ec8d74" class="outline-3">
<h3 id="org2ec8d74"><a href="#org2ec8d74">List Instance Profiles</a></h3>
<div class="outline-text-3" id="text-org2ec8d74">
<div class="org-src-container">
<pre class="src src-sh">aws iam list-instance-profiles \
    | jq '.InstanceProfiles[].InstanceProfileName'
</pre>
</div>
</div>
</div>

<div id="outline-container-org17db863" class="outline-3">
<h3 id="org17db863"><a href="#org17db863">Delete Instance Profile</a></h3>
<div class="outline-text-3" id="text-org17db863">
<div class="org-src-container">
<pre class="src src-sh">aws iam delete-instance-profile \
    --instance-profile-name $Name
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge90e732" class="outline-2">
<h2 id="orge90e732"><a href="#orge90e732">IMDS</a></h2>
<div class="outline-text-2" id="text-orge90e732">
<p>
<a href="http://169.254.169.254/latest/meta-data/">http://169.254.169.254/latest/meta-data/</a>
</p>
</div>
</div>

<div id="outline-container-org524a14d" class="outline-2">
<h2 id="org524a14d"><a href="#org524a14d">Kinesis</a></h2>
<div class="outline-text-2" id="text-org524a14d">
</div>
<div id="outline-container-orgfb070f7" class="outline-3">
<h3 id="orgfb070f7"><a href="#orgfb070f7">Delete Stream</a></h3>
<div class="outline-text-3" id="text-orgfb070f7">
<div class="org-src-container">
<pre class="src src-sh">aws kinesis delete-stream --stream-name $stream
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org447341c" class="outline-2">
<h2 id="org447341c"><a href="#org447341c">Kinesis Firehose</a></h2>
<div class="outline-text-2" id="text-org447341c">
</div>
<div id="outline-container-org538cae4" class="outline-3">
<h3 id="org538cae4"><a href="#org538cae4">Describe Stream</a></h3>
<div class="outline-text-3" id="text-org538cae4">
<div class="org-src-container">
<pre class="src src-sh">aws firehose describe-delivery-stream \
    --delivery-stream-name $StreamName \
    | jq '.DeliveryStreamDescription'
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c25db3" class="outline-3">
<h3 id="org1c25db3"><a href="#org1c25db3">Update Stream S3 Destination Bucket</a></h3>
<div class="outline-text-3" id="text-org1c25db3">
<div class="org-src-container">
<pre class="src src-sh">aws firehose update-destination \
    --delivery-stream-name $StreamName \
    --current-delivery-stream-version-id 1 \
    --destination-id destinationId-000000000001 \
    --extended-s3-destination-update \
    BucketARN=arn:aws:s3:::$BucketName
</pre>
</div>

<p>
THEN:
</p>

<ul class="org-ul">
<li>Update the Stream's IAM policy to allow it to write to the new location</li>
<li>Update the S3 Bucket Policy to allow the Stream's IAM Role to write to it</li>
</ul>
</div>
</div>

<div id="outline-container-org9a05898" class="outline-3">
<h3 id="org9a05898"><a href="#org9a05898">Update Stream S3 Destination Prefix</a></h3>
<div class="outline-text-3" id="text-org9a05898">
<div class="org-src-container">
<pre class="src src-sh">aws firehose update-destination \
    --delivery-stream-name $StreamName \
    --current-delivery-stream-version-id 1 \
    --destination-id destinationId-000000000001 \
    --extended-s3-destination-update Prefix=$Prefix
</pre>
</div>

<p>
Also may need to update the IAM Policy and the S3 Bucket policy, as above.
</p>
</div>
</div>
</div>

<div id="outline-container-org58ab81e" class="outline-2">
<h2 id="org58ab81e"><a href="#org58ab81e">Lambda</a></h2>
<div class="outline-text-2" id="text-org58ab81e">
</div>
<div id="outline-container-org6a93227" class="outline-3">
<h3 id="org6a93227"><a href="#org6a93227">Invoke function</a></h3>
<div class="outline-text-3" id="text-org6a93227">
<div class="org-src-container">
<pre class="src src-bash">aws lambda invoke \
    --cli-binary-format raw-in-base64-out \
    --function-name cf-Hello-World \
    /tmp/cats.json
</pre>
</div>

<p>
Invoke from a bastion host:
</p>

<div class="org-src-container">
<pre class="src src-bash">/usr/local/bin/aws lambda invoke \
                   --cli-binary-format raw-in-base64-out \
                   --function-name cf-Hello-World \
                   /tmp/cats.json
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">cat /tmp/out.json | jq -r '.body' | jq
</pre>
</div>

<p>
With payload file:
</p>

<div class="org-src-container">
<pre class="src src-bash">aws lambda invoke \
    --cli-binary-format raw-in-base64-out \
    --function-name hello-world \
    --payload file://tests/resources/event_alb.json \
    /tmp/out.json
</pre>
</div>
</div>
</div>

<div id="outline-container-org37e6f45" class="outline-3">
<h3 id="org37e6f45"><a href="#org37e6f45">Create Function with Zip File</a></h3>
<div class="outline-text-3" id="text-org37e6f45">
<div class="org-src-container">
<pre class="src src-sh">aws lambda create-function \
    --function-name artifacttool \
    --runtime python2.7 \
    --role $RoleArn \
    --handler lambda_function.lambda_handler \
    --zip-file fileb://$ZipFileName
</pre>
</div>
</div>
</div>
