notes/org/aws/commands.org
** Update Function code with Zip File

   #+begin_src sh
     aws lambda update-function-code \
         --function-name artifacttool \
         --zip-file fileb://$ZipFileName
   #+end_src

** Container Image: Run Interactively

   #+begin_src sh
     docker run -it --rm \
            --entrypoint bash \
            public.ecr.aws/lambda/python:3.8
   #+end_src

* Organizations

  #+NAME: OrgRoot
  #+begin_src sh
    aws organizations list-roots \
        | jq -r '.Roots[].Id'
  #+end_src

* Polly

  #+begin_src sh
    aws polly synthesize-speech \
        --engine standard \
        --output-format mp3 \
        --voice-id Amy \
        --text "All these cats wear hats." \
        /tmp/speech_standard.mp3 \
        && afplay /tmp/speech_standard.mp3
  #+end_src

* Reosurce Access Manager (RAM)

  This needs to be run against the AWS account that actually owns the shared
  resources. E.g. in a LandingZone environment, probably the shared-services
  account.

  #+begin_src sh
    aws ram list-resources --resource-owner SELF
  #+end_src

* RDS

** describe-db-instances

   #+header: :var db_name="foo-dev"
   #+begin_src sh
     aws rds describe-db-instances \
         --db-instance-identifier "$db_name" \
         | jq '.DBInstances[]'
   #+end_src

** modify-db-instance

   Run this command to apply pending maintenance:

   #+header: :var db_name="foo-dev"
   #+begin_src sh
     aws rds modify-db-instance \
         --db-instance-identifier "$db_name" \
         --apply-immediately
   #+end_src

** describe-db-engine-versions

   #+begin_src sh
     aws rds describe-db-engine-versions \
         --engine "postgres" \
         --filters 'Key=status,Values=deprecated'
   #+end_src

** pending maintenance actions for a DB

   #+begin_src sh
     aws rds describe-pending-maintenance-actions \
         | jq '.PendingMaintenanceActions[]
               | select(.ResourceIdentifier=="$DB_ARN")'
   #+end_src

** create-db-snapshot

   #+header: :var snap_id="my-snap-name"
   #+begin_src sh
     aws rds create-db-snapshot \
         --db-snapshot-identifier "$snap_id" \
         --db-instance-identifier work-number-dev
   #+end_src

   Check whether a snapshot exists yet:

   #+header: :var snap_id="my-snap-name"
   #+header: :var db_name="foo-dev"
   #+begin_src sh
     aws rds describe-db-snapshots \
         --db-snapshot-identifier "$snap_id" \
         --db-instance-identifier "$db_name" \
         | jq '.DBSnapshots[].OriginalSnapshotCreateTime'
   #+end_src

** create-parameter-group

   #+begin_src sh
     aws rds create-db-parameter-group \
         --db-parameter-group-name "cclark-test" \
         --db-parameter-group-family "postgres11" \
         --description "cclark test group"
   #+end_src

   #+begin_src sh
     aws rds modify-db-parameter-group \
         --db-parameter-group-name "cclark-test" \
         --parameters "ParameterName='max_slot_wal_keep_size',ParameterValue=4000,ApplyMethod=immediate"
   #+end_src

** describe-parameter-group

   #+begin_src sh
     aws rds describe-db-parameters \
         --db-parameter-group-name "cclark-test" \
         | jq '.Parameters[]
               | select(.ParameterName | contains("wal_"))'
   #+end_src

* Route53

** Get HostedZoneId from domain name

   #+NAME: HostedZoneId
   #+header: :var hostedZoneName="irondev.io"
   #+begin_src sh
     aws route53 list-hosted-zones \
         | jq -r --arg name $hostedZoneName \
              '.HostedZones[]
               | select(.Name == $name + ".")
               | select(.Config.PrivateZone == false)
               | .Id'
   #+end_src

** List Records for a HostedZone

   #+header: :var hostedZoneId=HostedZoneId
   #+begin_src sh
     aws route53 list-resource-record-sets \
         --hosted-zone-id $hostedZoneId \
         | jq '.ResourceRecordSets[]'
   #+end_src

* SageMaker

** list-models

  #+begin_src sh
    aws sagemaker list-models | jq '.Models[]'
  #+end_src

* SecretsManager

** List Secrets

   #+begin_src sh
     aws secretsmanager list-secrets \
         | jq -r '.SecretList[].Name'
   #+end_src

   Filter:

   #+begin_src sh
     aws secretsmanager list-secrets \
         --filters 'Key=name,Values=foo/bar' \
         | jq -r '.SecretList[].Name'
   #+end_src

** Get Secret

   #+header: :var SecretName="/ixiactl/BP_PASSWORD"
   #+begin_src sh
     aws secretsmanager get-secret-value \
         --secret-id $SecretName \
         | jq -r '.SecretString'
   #+end_src

** Create Secret

   #+begin_src sh :var SecretName="/ixiactl/BP_PASSWORD" SecretValue=""
     aws secretsmanager create-secret \
         --name $SecretName \
         --secret-string $SecretValue
   #+end_src

* ServiceCatalog

** Get Product IDs

   #+begin_src sh
     aws --profile main servicecatalog search-products-as-admin
   #+end_src

** Launch Product

   Note that user, even Admin user, must be added to the Portfolio users/groups.
   You can do this with =aws servicecatalog associate-principal-with-portfolio=

* Service Quotas

** Get all service quotas

   #+begin_src sh :results output
     aws service-quotas list-service-quotas \
         --service-code rds \
         | jq -c '.Quotas[] | {Value, QuotaName}'
   #+end_src

** Get one quota

   #+begin_src sh
     aws service-quotas list-service-quotas \
         --service-code rds \
         | jq '.Quotas[]
               | select(.QuotaName == "Parameter groups")'
   #+end_src

