docs/notes/aws/commands.html

<div id="outline-container-org1da8806" class="outline-3">
<h3 id="org1da8806"><a href="#org1da8806">Update Function code with Zip File</a></h3>
<div class="outline-text-3" id="text-org1da8806">
<div class="org-src-container">
<pre class="src src-sh">aws lambda update-function-code \
    --function-name artifacttool \
    --zip-file fileb://$ZipFileName
</pre>
</div>
</div>
</div>

<div id="outline-container-org61177cb" class="outline-3">
<h3 id="org61177cb"><a href="#org61177cb">Container Image: Run Interactively</a></h3>
<div class="outline-text-3" id="text-org61177cb">
<div class="org-src-container">
<pre class="src src-sh">docker run -it --rm \
       --entrypoint bash \
       public.ecr.aws/lambda/python:3.8
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdcc0535" class="outline-2">
<h2 id="orgdcc0535"><a href="#orgdcc0535">Organizations</a></h2>
<div class="outline-text-2" id="text-orgdcc0535">
<div class="org-src-container">
<pre class="src src-sh" id="org4b6b4fd">aws organizations list-roots \
    | jq -r '.Roots[].Id'
</pre>
</div>
</div>
</div>

<div id="outline-container-org77afbd8" class="outline-2">
<h2 id="org77afbd8"><a href="#org77afbd8">Polly</a></h2>
<div class="outline-text-2" id="text-org77afbd8">
<div class="org-src-container">
<pre class="src src-sh">aws polly synthesize-speech \
    --engine standard \
    --output-format mp3 \
    --voice-id Amy \
    --text "All these cats wear hats." \
    /tmp/speech_standard.mp3 \
    &amp;&amp; afplay /tmp/speech_standard.mp3
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f417a6" class="outline-2">
<h2 id="org4f417a6"><a href="#org4f417a6">Reosurce Access Manager (RAM)</a></h2>
<div class="outline-text-2" id="text-org4f417a6">
<p>
This needs to be run against the AWS account that actually owns the shared
resources. E.g. in a LandingZone environment, probably the shared-services
account.
</p>

<div class="org-src-container">
<pre class="src src-sh">aws ram list-resources --resource-owner SELF
</pre>
</div>
</div>
</div>

<div id="outline-container-orged392ac" class="outline-2">
<h2 id="orged392ac"><a href="#orged392ac">RDS</a></h2>
<div class="outline-text-2" id="text-orged392ac">
</div>
<div id="outline-container-org7f886c4" class="outline-3">
<h3 id="org7f886c4"><a href="#org7f886c4">describe-db-instances</a></h3>
<div class="outline-text-3" id="text-org7f886c4">
<div class="org-src-container">
<pre class="src src-sh">aws rds describe-db-instances \
    --db-instance-identifier "$db_name" \
    | jq '.DBInstances[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-org16b6eae" class="outline-3">
<h3 id="org16b6eae"><a href="#org16b6eae">modify-db-instance</a></h3>
<div class="outline-text-3" id="text-org16b6eae">
<p>
Run this command to apply pending maintenance:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws rds modify-db-instance \
    --db-instance-identifier "$db_name" \
    --apply-immediately
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f4c0c1" class="outline-3">
<h3 id="org8f4c0c1"><a href="#org8f4c0c1">describe-db-engine-versions</a></h3>
<div class="outline-text-3" id="text-org8f4c0c1">
<div class="org-src-container">
<pre class="src src-sh">aws rds describe-db-engine-versions \
    --engine "postgres" \
    --filters 'Key=status,Values=deprecated'
</pre>
</div>
</div>
</div>

<div id="outline-container-org9affadf" class="outline-3">
<h3 id="org9affadf"><a href="#org9affadf">pending maintenance actions for a DB</a></h3>
<div class="outline-text-3" id="text-org9affadf">
<div class="org-src-container">
<pre class="src src-sh">aws rds describe-pending-maintenance-actions \
    | jq '.PendingMaintenanceActions[]
          | select(.ResourceIdentifier=="$DB_ARN")'
</pre>
</div>
</div>
</div>

<div id="outline-container-org550d068" class="outline-3">
<h3 id="org550d068"><a href="#org550d068">create-db-snapshot</a></h3>
<div class="outline-text-3" id="text-org550d068">
<div class="org-src-container">
<pre class="src src-sh">aws rds create-db-snapshot \
    --db-snapshot-identifier "$snap_id" \
    --db-instance-identifier work-number-dev
</pre>
</div>

<p>
Check whether a snapshot exists yet:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws rds describe-db-snapshots \
    --db-snapshot-identifier "$snap_id" \
    --db-instance-identifier "$db_name" \
    | jq '.DBSnapshots[].OriginalSnapshotCreateTime'
</pre>
</div>
</div>
</div>

<div id="outline-container-org12c6d7c" class="outline-3">
<h3 id="org12c6d7c"><a href="#org12c6d7c">create-parameter-group</a></h3>
<div class="outline-text-3" id="text-org12c6d7c">
<div class="org-src-container">
<pre class="src src-sh">aws rds create-db-parameter-group \
    --db-parameter-group-name "cclark-test" \
    --db-parameter-group-family "postgres11" \
    --description "cclark test group"
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">aws rds modify-db-parameter-group \
    --db-parameter-group-name "cclark-test" \
    --parameters "ParameterName='max_slot_wal_keep_size',ParameterValue=4000,ApplyMethod=immediate"
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee75330" class="outline-3">
<h3 id="orgee75330"><a href="#orgee75330">describe-parameter-group</a></h3>
<div class="outline-text-3" id="text-orgee75330">
<div class="org-src-container">
<pre class="src src-sh">aws rds describe-db-parameters \
    --db-parameter-group-name "cclark-test" \
    | jq '.Parameters[]
          | select(.ParameterName | contains("wal_"))'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga7f2e6b" class="outline-2">
<h2 id="orga7f2e6b"><a href="#orga7f2e6b">Route53</a></h2>
<div class="outline-text-2" id="text-orga7f2e6b">
</div>
<div id="outline-container-org9955e19" class="outline-3">
<h3 id="org9955e19"><a href="#org9955e19">Get HostedZoneId from domain name</a></h3>
<div class="outline-text-3" id="text-org9955e19">
<div class="org-src-container">
<pre class="src src-sh" id="orge74718d">aws route53 list-hosted-zones \
    | jq -r --arg name $hostedZoneName \
         '.HostedZones[]
          | select(.Name == $name + ".")
          | select(.Config.PrivateZone == false)
          | .Id'
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd48bc48" class="outline-3">
<h3 id="orgd48bc48"><a href="#orgd48bc48">List Records for a HostedZone</a></h3>
<div class="outline-text-3" id="text-orgd48bc48">
<div class="org-src-container">
<pre class="src src-sh">aws route53 list-resource-record-sets \
    --hosted-zone-id $hostedZoneId \
    | jq '.ResourceRecordSets[]'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd2c2c24" class="outline-2">
<h2 id="orgd2c2c24"><a href="#orgd2c2c24">SageMaker</a></h2>
<div class="outline-text-2" id="text-orgd2c2c24">
</div>
<div id="outline-container-org11186f0" class="outline-3">
<h3 id="org11186f0"><a href="#org11186f0">list-models</a></h3>
<div class="outline-text-3" id="text-org11186f0">
<div class="org-src-container">
<pre class="src src-sh">aws sagemaker list-models | jq '.Models[]'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3882600" class="outline-2">
<h2 id="org3882600"><a href="#org3882600">SecretsManager</a></h2>
<div class="outline-text-2" id="text-org3882600">
</div>
<div id="outline-container-org1d541b3" class="outline-3">
<h3 id="org1d541b3"><a href="#org1d541b3">List Secrets</a></h3>
<div class="outline-text-3" id="text-org1d541b3">
<div class="org-src-container">
<pre class="src src-sh">aws secretsmanager list-secrets \
    | jq -r '.SecretList[].Name'
</pre>
</div>

<p>
Filter:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws secretsmanager list-secrets \
    --filters 'Key=name,Values=foo/bar' \
    | jq -r '.SecretList[].Name'
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b68467" class="outline-3">
<h3 id="org0b68467"><a href="#org0b68467">Get Secret</a></h3>
<div class="outline-text-3" id="text-org0b68467">
<div class="org-src-container">
<pre class="src src-sh">aws secretsmanager get-secret-value \
    --secret-id $SecretName \
    | jq -r '.SecretString'
</pre>
</div>
</div>
</div>

<div id="outline-container-org795edde" class="outline-3">
<h3 id="org795edde"><a href="#org795edde">Create Secret</a></h3>
<div class="outline-text-3" id="text-org795edde">
<div class="org-src-container">
<pre class="src src-sh">aws secretsmanager create-secret \
    --name $SecretName \
    --secret-string $SecretValue
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5f3f64c" class="outline-2">
<h2 id="org5f3f64c"><a href="#org5f3f64c">ServiceCatalog</a></h2>
<div class="outline-text-2" id="text-org5f3f64c">
</div>
<div id="outline-container-orgca6e0d5" class="outline-3">
<h3 id="orgca6e0d5"><a href="#orgca6e0d5">Get Product IDs</a></h3>
<div class="outline-text-3" id="text-orgca6e0d5">
<div class="org-src-container">
<pre class="src src-sh">aws --profile main servicecatalog search-products-as-admin
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad610cf" class="outline-3">
<h3 id="orgad610cf"><a href="#orgad610cf">Launch Product</a></h3>
<div class="outline-text-3" id="text-orgad610cf">
<p>
Note that user, even Admin user, must be added to the Portfolio users/groups.
You can do this with <code>aws servicecatalog associate-principal-with-portfolio</code>
</p>
</div>
</div>
</div>

<div id="outline-container-orgd46de62" class="outline-2">
<h2 id="orgd46de62"><a href="#orgd46de62">Service Quotas</a></h2>
<div class="outline-text-2" id="text-orgd46de62">
</div>
<div id="outline-container-org4b922f7" class="outline-3">
<h3 id="org4b922f7"><a href="#org4b922f7">Get all service quotas</a></h3>
<div class="outline-text-3" id="text-org4b922f7">
<div class="org-src-container">
<pre class="src src-sh">aws service-quotas list-service-quotas \
    --service-code rds \
    | jq -c '.Quotas[] | {Value, QuotaName}'
</pre>
</div>
</div>
</div>

<div id="outline-container-org9bacdde" class="outline-3">
<h3 id="org9bacdde"><a href="#org9bacdde">Get one quota</a></h3>
<div class="outline-text-3" id="text-org9bacdde">
<div class="org-src-container">
<pre class="src src-sh">aws service-quotas list-service-quotas \
    --service-code rds \
    | jq '.Quotas[]
          | select(.QuotaName == "Parameter groups")'
</pre>
</div>
</div>
</div>
