notes/org/aws/commands.org
** Get default quota

   Is this actually different from the above? What makes this default?

   #+begin_src sh
     aws service-quotas get-aws-default-service-quota \
         --service-code firehose \
         --quota-code "L-14BB0BE7" \
         | jq '.Quota'
   #+end_src

* S3

** Canonical ID

   #+begin_src sh :var BucketName=""
     aws s3api get-bucket-acl --bucket $BucketName
   #+end_src

** list-buckets

   List buckets that start with the name =$prefix=.

   #+header: :var prefix="foo"
   #+begin_src sh
     aws s3api list-buckets \
         | jq -r --arg prefix $prefix \
              '.Buckets[]
               | select(.Name | startswith($prefix)).Name'
   #+end_src

** Create Bucket

   #+header: :var BUCKET_NAME="cfc-s3"
   #+begin_src sh
     aws s3api create-bucket \
         --bucket $BUCKET_NAME \
         --create-bucket-configuration LocationConstraint=$AWS_DEFAULT_REGION
   #+end_src

** List Objects

   All objects

   #+begin_src sh :var BucketName=""
     aws s3api list-objects-v2 \
         --bucket $BucketName \
         | jq '.Contents[]'
   #+end_src

   10 most recent objects. AWS has no way of doing this filtering server-side,
   so you need to request all objects and then sort them.

   #+begin_src sh :var BucketName="" :results output
     aws s3api list-objects-v2 \
         --bucket $BucketName \
         | jq -r '.Contents
                  | sort_by(.LastModified)
                  | reverse | first | .Key'
   #+end_src

** Get object

   #+header: :var BucketName="" Key=""
   #+begin_src sh
     aws s3api get-object \
         --bucket $BucketName \
         --key $Key ./foo
   #+end_src

** Get multiple objects

   #+header: :var BucketName=""
   #+begin_src sh
     mkdir -p ~/Downloads/foo
     aws s3 cp \
         --recursive \
         s3://$BucketName/ \
         ~/Downloads/foo/
   #+end_src

** Get Bucket Policy

   #+begin_src sh :var BucketName="" :results output
     aws s3api get-bucket-policy --bucket $BucketName \
         | jq -r '.Policy' | jq
   #+end_src

** Clear and delete buckets

   To clear a bucket, I have functions for this in [[https://github.com/cfclrk/dotfiles/blob/master/dotfiles/.functions.fish][dotfiles/.functions.fish]].

* SNS

** SNS topics

   #+begin_src sh
     aws sns list-topics \
         | jq '.Topics[] | .TopicArn'
   #+end_src

* SQS

** List Queues

   #+begin_src sh
     aws sqs list-queues \
         | jq '.QueueUrls[]'
   #+end_src

** Read Message

   #+name: ReadMessage
   #+header: :var q_url="https://sqs.us-east-1.amazonaws.com/..."
   #+begin_src sh
     aws sqs receive-message \
         --queue-url "$q_url" \
         --attribute-names All \
         --message-attribute-names All \
         --max-number-of-messages 2
   #+end_src

** Send Message

   #+header: :var q_url=""
   #+begin_src sh
     aws sqs send-message \
         --queue-url "$q_url" \
         --message-body '{"Message": "{\"foo\":\"bar\"}"}'
   #+end_src

* SSM

  #+header: :var name="/aws/service/eks/optimized-ami/1.19/amazon-linux-2/recommended/image_id"
  #+begin_src sh
    aws ssm get-parameter \
        --with-decryption \
        --name $name
  #+end_src

* Identity Store (SSO)

  AWS SSO was renamed to AWS Identity Store.

  - [[https://docs.aws.amazon.com/singlesignon/latest/IdentityStoreAPIReference/welcome.html][Identity Store API Reference]]

    These API operations correspond to the =aws identitystore= commands.

  - [[https://docs.aws.amazon.com/singlesignon/latest/PortalAPIReference/Welcome.html][IAM Idenetity Center Portal API Reference]]

    These API operations correspond to the =aws sso= commands.

** Register client

   This command *does not* require AWS credentials. You only need a region.

   #+begin_src sh
     aws --region us-east-1 sso-oidc register-client \
         --client-name foo \
         --client-type public
   #+end_src

   Returns an object like:

   #+begin_example
     {
         "clientId": "abc1234",
         "clientSecret": "a JSON Web Token",
         "clientIdIssuedAt": 1659099242,
         "clientSecretExpiresAt": 1666875242
     }
   #+end_example

** Token

   #+begin_src sh
     aws sso login
   #+end_src

   #+NAME: SsoToken
   #+headers: :var token_name=""
   #+begin_src sh
     token_file=~/.aws/sso/cache/$token_name.json
     cat $token_file | jq -r '.accessToken'
   #+end_src

** List my accounts

   #+header: :var token=SsoToken
   #+begin_src sh :results output
     aws --region us-east-1 sso list-accounts \
         --access-token $token
   #+end_src

   #+header: :var account=123456789
   #+header: :var token=SsoToken
   #+begin_src sh
     aws --region us-east-1 sso list-account-roles \
         --access-token $token \
         --account-id $account
   #+end_src

** Get credentials

   The jq can be improved. See: https://github.com/aws/aws-cli/issues/5261

   #+header: :var account=123456789
   #+header: :var token=SsoToken
   #+header: :var role="tribe_sso_permission_set"
   #+begin_src sh :results file :file ~/.env/aws_creds
     creds=$(aws --region us-east-1 sso get-role-credentials \
                 --role-name $role \
                 --account-id $account \
                 --access-token $token)

     access_key=$(echo $creds | jq '.roleCredentials.accessKeyId')
     secret_key=$(echo $creds | jq '.roleCredentials.secretAccessKey')
     access_token=$(echo $creds | jq '.roleCredentials.sessionToken')

     echo "AWS_ACCESS_KEY_ID=$access_key"
     echo "AWS_SECRET_ACCESS_KEY=$secret_key"
     echo "AWS_SESSION_TOKEN=$access_token"
     echo "AWS_REGION=us-east-1"
     echo "AWS_DEFAULT_REGION=us-east-1"
   #+end_src
