docs/notes/aws/commands.html

<div id="outline-container-org5938041" class="outline-3">
<h3 id="org5938041"><a href="#org5938041">Get default quota</a></h3>
<div class="outline-text-3" id="text-org5938041">
<p>
Is this actually different from the above? What makes this default?
</p>

<div class="org-src-container">
<pre class="src src-sh">aws service-quotas get-aws-default-service-quota \
    --service-code firehose \
    --quota-code "L-14BB0BE7" \
    | jq '.Quota'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8cb6e83" class="outline-2">
<h2 id="org8cb6e83"><a href="#org8cb6e83">S3</a></h2>
<div class="outline-text-2" id="text-org8cb6e83">
</div>
<div id="outline-container-orgd915749" class="outline-3">
<h3 id="orgd915749"><a href="#orgd915749">Canonical ID</a></h3>
<div class="outline-text-3" id="text-orgd915749">
<div class="org-src-container">
<pre class="src src-sh">aws s3api get-bucket-acl --bucket $BucketName
</pre>
</div>
</div>
</div>

<div id="outline-container-org8437c60" class="outline-3">
<h3 id="org8437c60"><a href="#org8437c60">list-buckets</a></h3>
<div class="outline-text-3" id="text-org8437c60">
<p>
List buckets that start with the name <code>$prefix</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">aws s3api list-buckets \
    | jq -r --arg prefix $prefix \
         '.Buckets[]
          | select(.Name | startswith($prefix)).Name'
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb569f97" class="outline-3">
<h3 id="orgb569f97"><a href="#orgb569f97">Create Bucket</a></h3>
<div class="outline-text-3" id="text-orgb569f97">
<div class="org-src-container">
<pre class="src src-sh">aws s3api create-bucket \
    --bucket $BUCKET_NAME \
    --create-bucket-configuration LocationConstraint=$AWS_DEFAULT_REGION
</pre>
</div>
</div>
</div>

<div id="outline-container-org3598548" class="outline-3">
<h3 id="org3598548"><a href="#org3598548">List Objects</a></h3>
<div class="outline-text-3" id="text-org3598548">
<p>
All objects
</p>

<div class="org-src-container">
<pre class="src src-sh">aws s3api list-objects-v2 \
    --bucket $BucketName \
    | jq '.Contents[]'
</pre>
</div>

<p>
10 most recent objects. AWS has no way of doing this filtering server-side,
so you need to request all objects and then sort them.
</p>

<div class="org-src-container">
<pre class="src src-sh">aws s3api list-objects-v2 \
    --bucket $BucketName \
    | jq -r '.Contents
             | sort_by(.LastModified)
             | reverse | first | .Key'
</pre>
</div>
</div>
</div>

<div id="outline-container-org6660dfd" class="outline-3">
<h3 id="org6660dfd"><a href="#org6660dfd">Get object</a></h3>
<div class="outline-text-3" id="text-org6660dfd">
<div class="org-src-container">
<pre class="src src-sh">aws s3api get-object \
    --bucket $BucketName \
    --key $Key ./foo
</pre>
</div>
</div>
</div>

<div id="outline-container-org1fddda1" class="outline-3">
<h3 id="org1fddda1"><a href="#org1fddda1">Get multiple objects</a></h3>
<div class="outline-text-3" id="text-org1fddda1">
<div class="org-src-container">
<pre class="src src-sh">mkdir -p ~/Downloads/foo
aws s3 cp \
    --recursive \
    s3://$BucketName/ \
    ~/Downloads/foo/
</pre>
</div>
</div>
</div>

<div id="outline-container-org5dacec5" class="outline-3">
<h3 id="org5dacec5"><a href="#org5dacec5">Get Bucket Policy</a></h3>
<div class="outline-text-3" id="text-org5dacec5">
<div class="org-src-container">
<pre class="src src-sh">aws s3api get-bucket-policy --bucket $BucketName \
    | jq -r '.Policy' | jq
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec7aefc" class="outline-3">
<h3 id="orgec7aefc"><a href="#orgec7aefc">Clear and delete buckets</a></h3>
<div class="outline-text-3" id="text-orgec7aefc">
<p>
To clear a bucket, I have functions for this in <a href="https://github.com/cfclrk/dotfiles/blob/master/dotfiles/.functions.fish">dotfiles/.functions.fish</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org154e02e" class="outline-2">
<h2 id="org154e02e"><a href="#org154e02e">SNS</a></h2>
<div class="outline-text-2" id="text-org154e02e">
</div>
<div id="outline-container-org12b98d1" class="outline-3">
<h3 id="org12b98d1"><a href="#org12b98d1">SNS topics</a></h3>
<div class="outline-text-3" id="text-org12b98d1">
<div class="org-src-container">
<pre class="src src-sh">aws sns list-topics \
    | jq '.Topics[] | .TopicArn'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org09ca393" class="outline-2">
<h2 id="org09ca393"><a href="#org09ca393">SQS</a></h2>
<div class="outline-text-2" id="text-org09ca393">
</div>
<div id="outline-container-orgf6f0ddd" class="outline-3">
<h3 id="orgf6f0ddd"><a href="#orgf6f0ddd">List Queues</a></h3>
<div class="outline-text-3" id="text-orgf6f0ddd">
<div class="org-src-container">
<pre class="src src-sh">aws sqs list-queues \
    | jq '.QueueUrls[]'
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd684c4d" class="outline-3">
<h3 id="orgd684c4d"><a href="#orgd684c4d">Read Message</a></h3>
<div class="outline-text-3" id="text-orgd684c4d">
<div class="org-src-container">
<pre class="src src-sh" id="org967f7ac">aws sqs receive-message \
    --queue-url "$q_url" \
    --attribute-names All \
    --message-attribute-names All \
    --max-number-of-messages 2
</pre>
</div>
</div>
</div>

<div id="outline-container-org21bfe09" class="outline-3">
<h3 id="org21bfe09"><a href="#org21bfe09">Send Message</a></h3>
<div class="outline-text-3" id="text-org21bfe09">
<div class="org-src-container">
<pre class="src src-sh">aws sqs send-message \
    --queue-url "$q_url" \
    --message-body '{"Message": "{\"foo\":\"bar\"}"}'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf97ac30" class="outline-2">
<h2 id="orgf97ac30"><a href="#orgf97ac30">SSM</a></h2>
<div class="outline-text-2" id="text-orgf97ac30">
<div class="org-src-container">
<pre class="src src-sh">aws ssm get-parameter \
    --with-decryption \
    --name $name
</pre>
</div>
</div>
</div>

<div id="outline-container-org2823b6b" class="outline-2">
<h2 id="org2823b6b"><a href="#org2823b6b">Identity Store (SSO)</a></h2>
<div class="outline-text-2" id="text-org2823b6b">
<p>
AWS SSO was renamed to AWS Identity Store.
</p>

<ul class="org-ul">
<li><p>
<a href="https://docs.aws.amazon.com/singlesignon/latest/IdentityStoreAPIReference/welcome.html">Identity Store API Reference</a>
</p>

<p>
These API operations correspond to the <code>aws identitystore</code> commands.
</p></li>

<li><p>
<a href="https://docs.aws.amazon.com/singlesignon/latest/PortalAPIReference/Welcome.html">IAM Idenetity Center Portal API Reference</a>
</p>

<p>
These API operations correspond to the <code>aws sso</code> commands.
</p></li>
</ul>
</div>

<div id="outline-container-org39c2282" class="outline-3">
<h3 id="org39c2282"><a href="#org39c2282">Register client</a></h3>
<div class="outline-text-3" id="text-org39c2282">
<p>
This command <b>does not</b> require AWS credentials. You only need a region.
</p>

<div class="org-src-container">
<pre class="src src-sh">aws --region us-east-1 sso-oidc register-client \
    --client-name foo \
    --client-type public
</pre>
</div>

<p>
Returns an object like:
</p>

<pre class="example" id="org315e0cf">
{
    "clientId": "abc1234",
    "clientSecret": "a JSON Web Token",
    "clientIdIssuedAt": 1659099242,
    "clientSecretExpiresAt": 1666875242
}
</pre>
</div>
</div>

<div id="outline-container-orgf5857a2" class="outline-3">
<h3 id="orgf5857a2"><a href="#orgf5857a2">Token</a></h3>
<div class="outline-text-3" id="text-orgf5857a2">
<div class="org-src-container">
<pre class="src src-sh">aws sso login
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh" id="org2fd03f1">token_file=~/.aws/sso/cache/$token_name.json
cat $token_file | jq -r '.accessToken'
</pre>
</div>
</div>
</div>

<div id="outline-container-org82aff8f" class="outline-3">
<h3 id="org82aff8f"><a href="#org82aff8f">List my accounts</a></h3>
<div class="outline-text-3" id="text-org82aff8f">
<div class="org-src-container">
<pre class="src src-sh">aws --region us-east-1 sso list-accounts \
    --access-token $token
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">aws --region us-east-1 sso list-account-roles \
    --access-token $token \
    --account-id $account
</pre>
</div>
</div>
</div>

<div id="outline-container-org3bea523" class="outline-3">
<h3 id="org3bea523"><a href="#org3bea523">Get credentials</a></h3>
<div class="outline-text-3" id="text-org3bea523">
<p>
The jq can be improved. See: <a href="https://github.com/aws/aws-cli/issues/5261">https://github.com/aws/aws-cli/issues/5261</a>
</p>

<div class="org-src-container">
<pre class="src src-sh">creds=$(aws --region us-east-1 sso get-role-credentials \
            --role-name $role \
            --account-id $account \
            --access-token $token)

access_key=$(echo $creds | jq '.roleCredentials.accessKeyId')
secret_key=$(echo $creds | jq '.roleCredentials.secretAccessKey')
access_token=$(echo $creds | jq '.roleCredentials.sessionToken')

echo "AWS_ACCESS_KEY_ID=$access_key"
echo "AWS_SECRET_ACCESS_KEY=$secret_key"
echo "AWS_SESSION_TOKEN=$access_token"
echo "AWS_REGION=us-east-1"
echo "AWS_DEFAULT_REGION=us-east-1"
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>